{"business_id":"mYSpR_SLPgUVymYOvTQd_Q","date":"2015-05-27","review_id":"5iMYI_FQDtbSRJNkbniSaA","stars":5,"text":"I like this course. It's always very well maintained. The carts are in excellent shape, all electric and all equipped with GPS. The greens fees are extremely reasonable and many of the holes are challenging, even if you are a better golfer. It truly has a grand view up and down the Mon, from the Triangle and the Cathedral of Learning to Braddock, the Edgar Thompson Works, Kennywood and beyond. Yet, when you go a few more feet on the cart path, you are in the woods, alone with the abundant wildlife. One caveat- bring an abundant supply of balls. If you golf like I do, one sleeve will not be enough!","type":"review","user_id":"XN5PALUxEOxgUrhaXXAJzA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"mYSpR_SLPgUVymYOvTQd_Q","date":"2016-04-26","review_id":"XGObgnRNEOPMyQ3B9lAlhg","stars":5,"text":"2nd time playing here. Was in the area for a bowling tournament so a group of us decided to come early and get a round of golf in. The course is hilly and challenging with readable and fairly flat greens. But, as the name suggests, what a Grand View of both the course as well as the surrounding areas. \nCarts are in excellent shape and provide you with electronic scoring and course GPS.  The folks here take pride in their course and take very good care of it.","type":"review","user_id":"JRWpliEmVN3ghyh9NQr1yA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"mYSpR_SLPgUVymYOvTQd_Q","date":"2016-07-10","review_id":"5idUtnXsCzXDYECjaRphqA","stars":5,"text":"Challenging but fun course! Bring plenty of extra balls, I am a novice and lost at least 5. Carts are in great condition and remind you to stay on the cart path (sometimes annoying when looking for balls but safety first) and guide you to the next hole. The pro was very nice and patient with our group as we had to delay teeing off for an hour due to parkway closures. Driving range is nothing to write home about but gets the job done for warming up. Beautiful views and lots of variety of length and layout of holes. I'll definitely be back!","type":"review","user_id":"BkSeJo9g0s1YY7FSPqXSyg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"_qopVQ6_Mz6W7-Pmbi56GQ","date":"2013-02-13","review_id":"auC6xw7Xl7kDDSHefVIZ4g","stars":3,"text":"I'm not by any means a gear head, I'm lucky I know where to put the gas in my car. I have Triple A in case I get a flat, because I have no idea where my jack is. I took my present car back to the dealership the day after driving it off the lot to have them show me how to turn on my hazard signal, also, to show me how to release the parking brakes, and how to turn on the rear defoggers. Yes, the owners manual was in the glove box, but there was way too much reading involved, and I learn quicker by hands on training.\n\nAdvanced Auto is a God send for me, when I needed windshield wipers, the ones on the car sounded like a cow being skinned alive each time I turned them on. So, I didn't use them often, which isn't good in a driving rain storm. I walked in and went up to an associate and asked him where the wipers were. Not only did he get me the wipers, he saved me a ton of embarrassment by putting them on for me at no extra charge. I gave him a nice tip which he refused, but I insisted. I also picked up a nice leather steering wheel cover (proud to say I figured out how to put that on without a mechanic!) and a gas additive to clean out my fuel system. \n\nThis place has everything, and if you're not a gear head, they'll either show you how or do it for you. Great customer service!","type":"review","user_id":"bvu13GyOUwhEjPum2xjiqQ","votes":{"cool":2,"funny":1,"useful":2}}
{"business_id":"_qopVQ6_Mz6W7-Pmbi56GQ","date":"2014-02-19","review_id":"k3wTN0MQYEdnQsJEp99O4A","stars":5,"text":"Great people... great service... great products... always busy","type":"review","user_id":"_QFom7aSHKNCDsNXKd-3xQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"_qopVQ6_Mz6W7-Pmbi56GQ","date":"2015-12-17","review_id":"kj0kTIV4hoPQv4xlB7jZ2A","stars":3,"text":"I actually stopped at the one at the Crafton Ingram shopping center but they are all basically the same. \n\nI had been here earlier this year to get replacement wiper blades. The man who helped me not only gave me his recommendation on what would be good for winter driving but also put them on my car.\n\nToday's visit was to purchase some general car supplies as a holiday gift. They carry basically everything you need for self service. I'm not overly sure on their pricing but since it is convenient for me I visit it.\n\nSo far I've been pleased with my purchases.","type":"review","user_id":"9HCfCmd0t5GErgm7He6AeQ","votes":{"cool":1,"funny":0,"useful":0}}
{"business_id":"yXuao0pFz1AxB21vJjDf5w","date":"2010-01-27","review_id":"Ba193vShA-AKcfLYvaEOnA","stars":2,"text":"Average run of the mill store.  Associates are young teens and they really don't know where anything is.  Luckily I am able to get around to find everything.  Found my puppy treats and moved on.","type":"review","user_id":"T_wjLgPOPXry7Bea4MzoVQ","votes":{"cool":0,"funny":0,"useful":2}}
{"business_id":"yXuao0pFz1AxB21vJjDf5w","date":"2011-03-09","review_id":"bMCvh40U7J1xu3IwuulAPg","stars":3,"text":"Not bad for a Shop N Save, most are privately owned, so availability of items might differ from place to place. The only time I frequent S n S is when the have their huge two day sales usually held on Thursday and Friday at least once month.\n\nGood bakery at this location too.","type":"review","user_id":"bvu13GyOUwhEjPum2xjiqQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"yXuao0pFz1AxB21vJjDf5w","date":"2015-09-06","review_id":"5kttkNS9zOO5f6ZLkyVgtg","stars":5,"text":"This SnS and the one in Bethel Park are my two favorites.  Staff always friendly and the deli staff in both locations are great!  In my experience, if teen staff don't know where something is, they ask another staff member.  Shopping these two stores is as pleasant as it gets.","type":"review","user_id":"zo_soThZw8eVglPbCRNC9A","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"yXuao0pFz1AxB21vJjDf5w","date":"2016-05-21","review_id":"P5nGbY0zYWbpw-bLqMtLjQ","stars":4,"text":"One of the biggest,  cleanest, busiest shop N saves I have ever been to. Nice friendly staff. Great layout. And again, so clean!!!","type":"review","user_id":"uDIecT9tlTj1XIeqoyZUyg","votes":{"cool":7,"funny":2,"useful":6}}
{"business_id":"F04xyOUA2xnUoCiWpx9iJA","date":"2012-06-06","review_id":"VumdyF5zudGwYzEhK9z9ww","stars":3,"text":"Unfortunately, I only have one complaint about this dry cleaners. It was well kept and clean inside. The man waiting on me (I'm guessing the owner) was very nice, both dropping off and picking up, even though I lost my ticket. Turn around time was OK for a cleaners that don't do cleaning on premises. What's my problem then? Price. My daughter's dress was $18 to clean. I think that's close to what I paid for it. My ladies shirts were $6/unit. Maybe I'm not calibrated on Pgh prices but this seems outrageous. My search continues for a neighborhood cleaners. BTW, they do men's tailoring there on-site and it looks like it might be a big part of their business. I would try them again for that (after I check costs!)","type":"review","user_id":"6VEID9yjoYWFZkUcP_GNBg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"F04xyOUA2xnUoCiWpx9iJA","date":"2013-01-21","review_id":"y33A2bVRGcKT7gMKu-Yz4w","stars":1,"text":"Never go to Rossi Tailoring and Dry Cleaners 393 Vanadium Road Pittsburgh, PA 15243. I decided to use a local business to do my dry cleaning. I dropped off 3 shirts at this establishment just before Thanksgiving. It is now late January. I have stopped by more than a half dozen times and have been given only ONE of the shirts. They have offered $20 a shirt for the shirts they lost. Those shirts are worth at least $50 each, and I refuse to take under $30 for each. I am tired of the run around, tired of promised phone calls that never happen (they have NEVER called me).  I wouldn't use their services again if you paid me to.","type":"review","user_id":"d_zE235hKwYut4gyhx3HoA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"F04xyOUA2xnUoCiWpx9iJA","date":"2013-02-24","review_id":"zmu4rU3VRGNNTehRY0tZlQ","stars":5,"text":"I went to Rossi's for my first time, two weeks ago. I had two suits and one jacket tailored. Everything was ready in less than two weeks. These suits were brand new and on the expensive side. I didn't know who to trust them with. I went to Rossi's because a friend highly recommended them. My friend had a tuxedo custom made by Rossi's. \n\nI am extremely happy with the end results!\n\nI wanted a European cut on jackets and no break on the slacks; a nice tailored look. The suits look awesome. I'm going to go through my closet and take some of my older suits to be tailored (some of my older suits are a little looser fitting; I now like the more tailored European look). Juliano (the owner) will shorten the length of my jackets, take the sides in and shorten my slacks. They'll look brand new.\n\nAs for the price, I'm very happy. I wouldn't go to the cheapest barber in town (for obvious reason). I feel the same about a good tailor. As for the service, they couldn't be nicer. \n\nThanks for a job well done!","type":"review","user_id":"0GysS-pe5jYkiE3eglobgA","votes":{"cool":0,"funny":0,"useful":2}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2009-06-10","review_id":"RKSwdhP-xQLXm6ShTwknew","stars":3,"text":"This is a tiny Starbucks and it locations like this (although cute) makes you wonder if your really meant to hang out or just grab your coffee and leave. Leaving is always a good idea at this location anyway since you have a nice fountain in the back with benches and it is a central part of the Waterfront Shopping. \n\nStarbuck isn't my favorite coffee chain by any means. Is it just me or do all Starbuck coffees taste a little burnt and bitter? No matter how trendy, cool and upscale their establishments are I can't get around the yicky tasting bitterness of Staryucks regular coffees. Talk about over roasting a bean...Maybe something has changed with their regular coffee but I have not drank it in about a year. I am not one for soy caramel latte foofy stuff. Still I'll give the establishment tres estrellas for the fact that their espresso is acceptable and doesn't taste half as bad as the regular coffee bean.","type":"review","user_id":"7DeM4C66zVflYNrZn_Vv9g","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2009-06-24","review_id":"rbS5aHwGyDJqiQOZptRJlQ","stars":5,"text":"Friendly staff, same starbucks fair you get anywhere else.  Sometimes the lines can get long.","type":"review","user_id":"WMTm9HHRA3EewoxTX1Gleg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2009-11-10","review_id":"uHLsTyhQN5LDc8ptZICyfw","stars":3,"text":"Mmm...peppermint mocha\n\nIn my quest to visit every Starbucks in the USA I have stopped at yet another location.  This one is located in the center of a circle road -- very cache and in a newer part of the area.","type":"review","user_id":"T_wjLgPOPXry7Bea4MzoVQ","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2009-11-10","review_id":"4IN_2lcUNoqGthJJACSdgg","stars":2,"text":"Typical Starbucks coffee chain. 2 things I dont like about this Starbucks: \n\n1. Ive been there twice and both times the place has been dirty, compared to the other Starbucks I have been in.\n\n2. If you have to use the bathroom, they give you a key thats attached to this nasty bottle. Im pretty sure they dont clean that bottle after every use or even nightly.\n\nAside from that, good coffee and fast/friendly service.","type":"review","user_id":"vjcjHR3G_Vu-Ruo5JcLtWA","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2011-05-12","review_id":"hD8oO6oSGfCvsTKKey1Xow","stars":2,"text":"If there was ever a \"get your coffee and go\" Starbucks, this is it. Right in the center of the Waterfront, this Starbucks has no sofa, comfy chairs, only table seating. I love the baristas here, But I don't like the location of the building.","type":"review","user_id":"bvu13GyOUwhEjPum2xjiqQ","votes":{"cool":0,"funny":0,"useful":2}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2012-03-04","review_id":"mSbZfQotMz3xJ5vNAJnM9Q","stars":3,"text":"This is a typical Starbucks. The coffee is good but the store is suprisingly dirty.","type":"review","user_id":"xTzu_aNCPiie5Vj11cAxyQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2012-05-24","review_id":"K527ATdXzEoM8MSd7zBLBg","stars":3,"text":"I have to agree with Joe on this one.  The baristas are extremely friendly, and the service is great, but the fact that there are no comfy chairs or couches is very unwelcoming.  I do think however that the building is beautifully ans strategically located in the center of the shopping.  I just wish they had better seating.","type":"review","user_id":"bSkco4ZdB7REFtDsJUVrDA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2013-01-27","review_id":"5ClL6pOSc0LV0cKn-EXZiQ","stars":3,"text":"I just realized they remodeled this one recently-ish. Well, in my world recently because it's been a while since I've been here.\n\nThey've added more seating which makes it way more conducive to having a meeting here. Which is my concern during the week. I imagine during the weekend it just fills up with tweens getting their sugar rush before hitting the movie theater. \n\nThe coffee, or tea for me.. Is still same old same old. I don't imagine one single Starbucks will break the mold and make original drinks...","type":"review","user_id":"nEYPahVwXGD2Pjvgkm7QqQ","votes":{"cool":2,"funny":1,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2013-06-26","review_id":"kzkG0YHBlNGkCoQuqryKsA","stars":5,"text":"Great location!  Close to shops and theatre.  Nice staff.","type":"review","user_id":"-xPKyCJiK9q1OFZ7GCZwBw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2013-08-23","review_id":"CAqMq5HbwVsyHMWAO95rjg","stars":4,"text":"Regarding quality of beverage, this is just your average Starbucks. I can't complain but am not blown away either. However, I really like the location of this shop, which is located in the center of The Waterfront's specialty retail shops. Though in the midst of a lot of retail, the surrounding area is very picturesque with pretty green grass, flowers, and a fountain. Hanging out here is very relaxing.","type":"review","user_id":"Q3fFv_ft17OyV-NRF1iQxw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2014-01-06","review_id":"OmZbJXtVFPhOtVWrs9xq-g","stars":4,"text":"I love the location of this Starbucks, which is why I'm giving it 4 stars. It's right smack in the middle of clothing stores, the Loews movie theater, as well as restaurants. I love grabbing a mid afternoon latte here on a Saturday while perusing various stores such as the Gap or Loft. I also like coming here before or after a movie for a quick caffeine jolt.\n\nWhile the drinks are the same as you would find at any Starbucks, the baristas and staff are really friendly, perhaps more so than other area Starbucks. \n\nMy drink or choice when I come here generally in the mod afternoon is a venti (or trenta...) berry hibiscus refresher. Yum! It is the perfect afternoon pick-me-up that leaves me feeling refreshed and hydrated.","type":"review","user_id":"o9XGClSBzCsQxbcCzTPdnQ","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2014-02-11","review_id":"iKwG_wmOX4WvED0NbLbbZw","stars":2,"text":"This Starbucks is teeny-tiny!\n\nSeating inside is VERY limited.  This is a Starbucks to grab and go and continue your shopping at the Waterfront.\n\nBaristas are friendly and fast.","type":"review","user_id":"6Mflt7fworNLu031TDrDSA","votes":{"cool":0,"funny":0,"useful":2}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2014-02-20","review_id":"jHi7-GytR2lSSRdf0_wM_g","stars":3,"text":"As far as Starbucks go, this is a pretty nice one.  The baristas are friendly and while I was here, a lot of regulars must have come in, because they bantered away with almost everyone.  The bathroom was clean and well maintained and the trash wasn't overflowing in the canisters around the store.  The pastries looked fresh, but I didn't partake.  The noise level was also at a nice working level - not too loud, music just barely audible.\n\nI do wish there was more seating.  It is nice that this location has a counter at the end of the bar for sole workers, but it doesn't replace more tables.  I'm sure this isn't as much of a problem in the summer when there's the space outside.\n\nThere was a treat receipt promo going on, but the barista didn't tell me about it, which I found odd.  Usually when they have promos like that going on, they ask everyone if they want their receipt to come back later in the day to claim whatever the offer is.  Today it was one of their new pastries for $1, I know in the summer they do $2 grande iced drinks with that morning's receipt.\n\nOverall, nice working or socializing environment.  Very friendly and inviting.  It's what I've come to expect from Starbucks, so points for consistency.","type":"review","user_id":"FKosz9ExVLhsrITQk5xl4g","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2014-02-21","review_id":"oyOQ8uFapRgu1GTPw3IG4g","stars":2,"text":"I'm not a huge fan of this location. I think that it was oddly built- the small, alley-like front makes it difficult to get past people on your way to/from the bathroom or tables when it's busy. And there's hardly any tables to sit at. Furthermore, people tend to clog the front on their way in, which makes things particularly difficult (especially in the winter weather). The staff were pretty impersonal to be, but maybe that was due to the high traffic of the place and the time I was there. And the coffee that I had was cold- I'm sure it was probably the bottom of the batch. I'd probably only walk in here again if someone else suggested it before or after a movie or while we were shopping in the area.","type":"review","user_id":"RSExP0-Boucr4QyIEzZi0A","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2014-08-21","review_id":"Fa42fRLXZXifjwqWEfhk5A","stars":5,"text":"This Starbucks is 5-Star Friendly. The shift supervisor Lucious keeps the energy in there moving and light. He recently helped me with a merchandise return and embodied everything a good manager and all around mensch person should - patience, kindness, generosity and fairness. I left that afternoon loving Starbucks even more than when I went in. It's great that a company and their employees can be as loyal to their customers as their customers are to them.","type":"review","user_id":"1NqTU6vbr6xdI1hDUlJ_dA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2014-11-22","review_id":"vw8Te7pbML59Cje1G7xbDA","stars":5,"text":"I am always so pleased with the customer service here. For such a tiny Starbucks, the do a really great job serving the masses that come in there and still manage to take the time to be friendly in the midst of the frenzy. \n\nOutdoor seating in the summer is nice.","type":"review","user_id":"JPPhyFE-UE453zA6K0TVgw","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2015-06-28","review_id":"qkJfGS0e0zCPRqwt-Hxh-A","stars":2,"text":"This particular Starbucks was especially pushy with offering extra espresso shots when placing my order. This has never happened before and it took me off guard.  The barista came off dishonest and unfriendly with the up sell push.  I will avoid this one at the Waterfront for awhile.","type":"review","user_id":"e7lJwGbdJsrFziQoXKNJ6w","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2015-11-23","review_id":"aO85QduVCnYbh4XmO4EIbg","stars":4,"text":"Oprah Chai Latte! Great central spot in this out door mall. Staff was pretty efficient and fast.","type":"review","user_id":"W5mmO5HIk-qc0GzH6yhyyw","votes":{"cool":1,"funny":0,"useful":0}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2015-12-08","review_id":"04K3VySgUnjgu476SzvPbQ","stars":3,"text":"Starbucks is a chain coffee and tea shop you will find most everywhere. They offer free WiFi. They sell their coffees in bags if you like. They also serve sandwiches and pastries. Some of the Starbucks I've seen offer drive through services. Prices are reasonable.\n\nI stopped in here since I've been hunting all over for a gingerbread man cookie. They told me they are getting one in and ugly sweater design but they don't have it yet. I plan to keep checking since it appears that no place I have been to has my holiday favorite so I'll certainly be back to one of their locations.","type":"review","user_id":"9HCfCmd0t5GErgm7He6AeQ","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2016-05-15","review_id":"y0m_UjM8VaY24ZmdEyF_Ww","stars":2,"text":"This is a typical Starbucks, but in a particularly cramped building without much room to spread out an work if you desire.  It is nice that it had a bit of outdoor seating and wifi.  Over several other coffee alternatives nearby in the Waterfront, I would rate this as low.  Barnes and Noble has more comfortable seating and access to many books and other amenities.  Panera also has more seating, cheaper coffee and a plethora of menu items to go along with the coffee.  The Starbucks building style an architecture is attractive, but just too small and limited for this busy Waterfront location.","type":"review","user_id":"rONxiM8Hafy5kba3ZLoCbA","votes":{"cool":17,"funny":12,"useful":22}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2016-05-15","review_id":"dfzpqggmPl0gfeEkUSWZaw","stars":4,"text":"This is actually a very good Starbucks. The staff is always nice and they keep the store clean. It's definitely convenient if your down here shopping or going to see a movie. The only thing that stops it from getting 5 stars is the parking. Considering its in the middle, of the waterfront, parking can be a big problem.","type":"review","user_id":"gfagwUKzS9bL89oUv32ecw","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"3gmBc0qN_LtGbZAjTtHWZg","date":"2016-07-11","review_id":"4ihDKETVyTfKz9YyqISSWw","stars":5,"text":"Great drinks, clean facility, and super friendly staff!","type":"review","user_id":"SLierwYJc62TIZG-CCokSg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2007-09-11","review_id":"x09uNsz2_-FKyl-MSLBPwQ","stars":1,"text":"Horrible beer, horrible service, horrible menu","type":"review","user_id":"IbvOxKSps_K5wa3a2_jc-Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2008-09-15","review_id":"kiszja04ALGKaNpZiZVwrQ","stars":2,"text":"SUMMARY:\nIf I was in the area and no one had a better suggestion for where to go, I might come back for beer and appetizers.\n\nGOOD:\n- Decent beer...\n- Original pretzel appetizer.  You take chunks of soft pretzel and dunk it in spinach cheese dip.\n- Huge portions.  Most of us had leftovers.  The RB Appetizer Sampler was multi-story and way more food that we could handle.  The half order of ribs looked like a full rack.\n- Attentive service with quick seating and frequent drink/water refills.\n- Amusing name.\n\nBAD:\n- Lots of food choices... burgers... steak... chicken... salads.  Lots of drink choices... beers... wines... mixed drinks.  I guess this could be seen as good, but it takes a while for everyone to pick something and since no one's awesome at everything, you could tell right away that nothing distinguishes this place.\n- None of the food was super awesome.  Nothing was awful, but nothing stood out in any way.  I've had better beer, appetizers, and a better main course at plenty of breweries.\n- Kind of dead on a Monday night with 3/4 of the place empty.\n\nCome if you want bar food, but keep your expectations low.","type":"review","user_id":"vNm0EuNWJ0GZwQifrxDWAQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2008-09-23","review_id":"deX5DZTm9ApdajNsMKi3_w","stars":5,"text":"I am a big fan of Rock Bottom.\nThere are several dishes that are MONEY.\nAppetizer:  Seared Ahi, Spinach Artichoke Dip\nEntree :      Fire Steak, Pub Tips or Chicken Fried Chicken.\nDesert :      Carrot Cake (to die for)\nBar food:     Pizza or ball park pretzels.  Both of which are sprayed with brown ale.  \nHalf the menu is really good, the other half is great.  \nThe beer is good.  Ask for the sampler!  They usually have a velvet and something on cask.  Ask for one of those if you are looking for something different.  They will also have a scotch ale, an IPA, whiskey stout or other specialty depending on the mood of the brewer (which, if its still Matt, the mood is GRUMPY).   If Andy is still working there, he is sure to please and Molly is great in the cocktail area.\nHead over to Sing Sing after dinner and its a wrap.\nI used to work there several years ago and I make it a point to hit every RB I possibly can.\nDon't go to the one in Charlotte though, its not really a Rock Bottom.","type":"review","user_id":"NCYse908q22pjK4SrmDA5g","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2008-12-03","review_id":"KhiBfsXVfOJU1wnN_NbJQw","stars":3,"text":"I thought this place was pretty decent. My friend and I were both still reeling from thanksgiving dinner so we ordered salads... and they were HUGE. and tasty. I liked my salad though it was slathered in way too much dressing. My friend's was even more slathered so she didn't dig it too much. We'd also ordered chips with guacamole, the guac was pretty good. my friend enjoyed her beer. I enjoyed my coke (I know, I'm lame).\n\nso yeah... wasn't bad, wasnt the best, but it was okay.","type":"review","user_id":"-J9FWRI3Wj2U9eUULJPNFQ","votes":{"cool":1,"funny":0,"useful":2}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2008-12-03","review_id":"nx2cFeFEdagdV4roMDhCeg","stars":2,"text":"Microbrewed beers are only a plus to me when they're better than the beer I would have drank otherwise.  One waitress I had while there tried to split the uprights between macrobrew and trendy by describing one of their beers as \"kind of like Coors Light\".  If I wanted Coors, I'll pay half as much and have one.  \n\nThe food is actually a saving grace, as it was pretty good.  Head next door to Sing Sing for drinks, though.","type":"review","user_id":"LhgQq1x4n9ardg1PFo8vgg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2009-06-24","review_id":"bkbI7RFGbFndi9qxK_LVgA","stars":3,"text":"Not the greatest ale house in the city but certainly not the worst.\n\nI like the food and I have tried all the beers.  They're just \"OK\" as far as beer goes.\n\nLarge portions. Friendly staff.","type":"review","user_id":"WMTm9HHRA3EewoxTX1Gleg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2009-11-02","review_id":"RCyXqcI304lWeqqpPHsMpg","stars":1,"text":"My friends got everyhing from steak(they didn't even get a well done steak right) to mahi tacos and the only great menu item was the seasoned vegetables- give it a miss. Sing sing next door is awesome but get dinner somewere else. After we were done the waiter asked if we were ready for the checks and I had ordered meal that came with a desert! Really dissapointing all around.","type":"review","user_id":"Hr1YoQltzetmVco5oncaPA","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2009-12-17","review_id":"PgmVt9BoPnSYxsfxVMwvkw","stars":3,"text":"everytime i come here i stick with the nachos add chicken add side of guac and i've never been dissappointed.  i sit in the bar, grab a drink or 2 and eat those nachos.  the bar has a pool table and plenty of flatscreens.  rock bottom is a chain but it's one of the better chains in the area.  i'll pass on chili's or friday's and come to rock bottom instead.  oh and typically i walk over to target - work off some of those nachos.","type":"review","user_id":"fFoRIzbwpMiv3BvfdtdlXQ","votes":{"cool":2,"funny":1,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2010-04-02","review_id":"i8uTpvLVeHSEdRIYgFK49w","stars":4,"text":"Nobody has reviewed this in a while, but I am surprised at the lack of lovin'!  My husband and I ate here a few nights ago and we liked it a lot.\n\nWe started with drinks--he got the house-brewed Portland Wheat and said it was quite a good beer, and I got a mixed drink (Red Rock) that was also tasty.  \n\nHe got a burger covered in mozzarella cheese and I got a mahi sandwich.  Both great--the fries and side salads are good here too, and there is no skimping on portions of anything.  There were tons of things on the menu that I'm looking forward to trying.\n\nWe are usually not dessert people at all but ended the meal sharing a triple chocolate stout cheesecake--who can resist a beer cheesecake, come on!\n\nOur food and service was great.  They had the Penguins game on all the TVs in the bar and were setting up live music for after the game.  Seriously, what's not to like!?  I'm thinking this place has changed for the better since the last review a year ago... :)","type":"review","user_id":"FyCBkNXwoI_6X6apbslg4g","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2010-05-10","review_id":"5gS9IMXN1--NKjB2QCw5AQ","stars":4,"text":"This is literally the first place I went when I first came to Pittsburgh - and I loved it. Hearty, full-sized meals, lots to choose from, and not too crowded or noisy. Although, for the sake of full disclosure, I didn't sit at the bar and I don't drink alcohol so I can't comment on that. I go back to Pittsburgh often and Rock Bottom ends up being a good standby for a dinner and a movie kind of night. Really, I have no complaints about this place so I'm surprised by the few low ratings here.","type":"review","user_id":"6rhAsfzfeb1hb91bQBipKg","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2010-07-04","review_id":"l1oakOvG_LISDM9vT8-UjA","stars":3,"text":"Little slow on the service and didn't have the beer I wanted on the menu. But you get those things when they brew their own beers on-site.   But the stadium pretzels are good.  The cream stout is tasty.\n\nThe burgers are good and big with the little skinny fries.  I'm not a fan of the skinny fry, but hey the burgers would choke a horse - and almost did.  :o)","type":"review","user_id":"G7KQF0U0p25nf07dObPeVg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2010-08-13","review_id":"a7VapmDD9a80z2uByS0K_w","stars":2,"text":"Lately, the Rock Bottom is hit or miss. The beers are always good and the Uppity Jagoff IPA is one of the best India Pale Ales I've ever tasted. The low point lately has been the food. I will never forgive the idiot in management who took the chicken quesadilla off the menu. That said, I ordered the lobster roll and when it arrived, the bread was as hard as a brick and cold. The filling was okay, but the lobster flavor was masked by over spicing. I suggest you eat somewhere else and imbibe at the Rock Bottom.","type":"review","user_id":"bvu13GyOUwhEjPum2xjiqQ","votes":{"cool":1,"funny":1,"useful":3}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2010-11-12","review_id":"DjFojcTtj99oZMqyoOEdSA","stars":4,"text":"Pretty good! Excellent beer sampler - bargain!  Veggie burger awesome. Onion rings awesome. Fried Mac n cheese was delicious - crunchy on the outside, creamy on the inside. Carrot cake was monstrously huge and delicious.","type":"review","user_id":"z8kmZwIcJ2D3rSMIHDuaLg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-01-18","review_id":"j7TfEsZYkO0ARRBnPyYLQA","stars":4,"text":"First off, I will say that I just moved here from California and was a big patron at the Rockbottom in Long Beach. I came to the Homestead location last night eager to see the beer at this location.\n\nNow, Rockbottom is a chain brewery, so a lot was the same... the menu, the food prices (yet beer is cheaper, and I am fine with that). I have always found their food to be pricey, but they use excellent ingredients and it has always been tasty and filling so I am fine with that. The food here was just as good as the Long Beach location, so I have no problem with the chef at all.\n\nService was good, our waitress was very friendly and helpful. I wish that they had asked us if we wanted to sit in the bar since happy hour was still going, but that isn't a big thing. Went to the bar to get a drink and had to wait awhile to get the bartender's attention, but he was very friendly and I got a nice welcome from him and others at the bar when they learned I had just moved here... I really enjoyed that.\n\nBeer: We got the beer sampler to try the whole list... and, well... I found the dark beers a bit lacking in comparison. The light beer and the wheat were amazing, very impressed. The pale was ok, as was the velvet pale that was one of the specials of the night... but both were way too citrusy. The Uppity IPA was very good... I don't usually like IPAs because the hops overpowers all flavor but the brewer had a good balance. Still, couldn't do a whole glass. I felt the Imperial Stout had a bitter burned taste that was overpowering... I almost want to say the batch had too much chocolate malt in it (not ice cream malt, for the non-homebrewers). The brown and amber were decent, but bland. I ended up getting an actual glass of the light beer and was able to finish it all without forcing it.... one point up on Long Beach, who had a good light but the aftertaste got to you before the glass was empty.\n\nI REALLY wanted to try the Das Gut Dopplebock, but they were out. Looks like they will have it in bottles to go soon so I hope I can catch that. Also want to try the Snow Moon Belgian.\n\nVerdict: While I was not too impressed with the dark beers, I found the lighter ones very good and I look forward to trying the other seasonal beers. It is a good hour drive south to get there, so I won't be going too often, but I will be back.","type":"review","user_id":"gJhd8oM1yRDDGe3SPaC5Gw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-01-25","review_id":"vDAA_k_8J1z0pz2tRH6ESg","stars":3,"text":"Even since Rock Bottom opened (7 years ago???) I have always thought it was a dance club.  I am not really sure why but I thought it was along the same line as (throw back) Hi-Tops but I did. I think I always thought this place was a club because of the behemoth size of the space. \n\nWell I was out with a friend and we needed a place to go before a show at the Improv and Rock Bottom was close. \n\nPart of this is my fault...I always order \"healthy\" items at places that specialize is greasy bar food...then I am upset when the meal isn't 5 star.  \n\nI started off with one of their wheat beers, it was alright. I nursed it all through dinner so I don't think I was head over heels in love with it.  I got the Catch of the Day, Off the Hook, Fish Dish, Sailors Delight or something(I forget it had some cheesy fish themed name).  It was cod (meh, that should have been the sign not to get it) with roasted asparagus and lemon rice.  The fish was suppose to be broiled but it had a thick breading (annoyed) and the portion of fish was tiny. The rice and asparagus were great though. \n\nMy friend got a chicken sandwich which he enjoyed although the fries were pathetic.  The fries were probably pre-cut frozen fries or just very poorly executed.  They were so thin that you have to grab a huge handful just to get any actual potato flavor.\n\nPros: A lot of tables (no wait), brew special beers, big menu, could hear the dueling piano bar next door\n\nCons: Place was fairly empty and we got a crappy table by the door when it was 5 degrees outside, most of the food was fried, cheese filled, cream based, or wrapped in bacon.  I know some people love to eat food like this all the time( I do every once in awhile) but if you eat out a lot you can't always get the spin dip, burger, and ice cream sundae.  (I would love to but its just not in my cards). I do like like when causal places offer some healthy options.","type":"review","user_id":"scIDar9VGDMcTOHbem37pg","votes":{"cool":1,"funny":0,"useful":3}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-02-18","review_id":"L0aw0Rwrq2LI6FaibLvZ5w","stars":3,"text":"Went with a group after work for dinner and a brew.  We ordered a few appetizers first.  The wings are good and the soft pretzels with spicy spinach cheese dip was fun.  Had a burger, you can create your own from veggie, turkey, or fresh ground beef. Had a fresh ground beef and the meat was fresh and cooked perfectly with a fresh bun.\n\nThe brew pub is nice and was surprised it wasn't busier.","type":"review","user_id":"9cCTmiJ7hz35rHIdr8n9kA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-02-20","review_id":"NUri2Yx3OQCtyzIPcqz7jQ","stars":3,"text":"Here's the trick to enjoying a meal at Rock Bottom: don't get fancy with your food order.  Stick with the sandwiches, salads, burgers, and bar food; and you'll be OK.  I've had bad experience will all the fish dishes (including the fish and chips).  Also, I've found the service is generally better in the bar area than the dinner area.  Join the Mug Club, even if you don't go often, and rack up points for free mugs and beers.  Thursdays are Trivia Nights and the DJ is playing the music loud, so go if you don't really want to have a conversation with the person you're with :)","type":"review","user_id":"B5WkNWDxZ-baWoQc6DBNHA","votes":{"cool":1,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-03-30","review_id":"Fl_dFfwfuk9T8kv-k-p8iw","stars":4,"text":"Beer selection was good, but they were out of the ones we wanted. 4 of the 6 people in our group ordered steaks all of them were cooked to their satisfaction. The bourbanzola was a good addition. Defiantly a place I would go again. Joe, our server, was awesome and super friendly.","type":"review","user_id":"3q9p6IZTuIt59z7MxzjVVg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-03-31","review_id":"44_xOh7VDSMJtyk6QCNEaQ","stars":5,"text":"I love this place!  Great atmosphere and friendly service every time I go!!","type":"review","user_id":"QmykNasFdjyaQ3K8oME3fQ","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-04-18","review_id":"odIM8VqM-03YStvfBXIo5A","stars":4,"text":"Rock Bottom is a nice hangout place. Often when you are out and about with friends you arrive home with no voice from screaming over all of the background noise. Great if your out to see a band, but not so much fun if you actually want to talk to the people sitting around you. \n\n\nDepending on your mood you can sit in the dining area full of booths and tables. It's alittle separated from the main bar area so provides for a semi quiet dining area. The bar area gives you a choice of sitting at the surrounding tables with waitress service or hanging out at the bar itself. Complete with a chillie ice strip to keep those yummy brews cold and the ever entertaining company of your favorite bartender. When the weather cooperates the outdoor patio houses about 6 tables for outdoor dining. The view however...not so picturesque, just the entrance to the Improv. Which hey, that could be the perfect seat if you're stocking the local comics! \n\n\nThe bar area contains pools tables and dart boards to try your skills. On any give night sports fans can enjoy the games of the day on one of the 6 big screen TVs surrounding the bar area. \n\nThe menu is pretty decent with burgers that are cooked to order with the choice of either steak , veggie or chicken. They have a number of specialty burgers with different cheeses, toppings and creative themes. The bourbonzolla is a tasty burger with a Bourbon based glaze and Gorgonzola cheese. Appetizers which range from nachos to firecracker shrimp. Steaks, pasta and salads with rotating specials from different areas of the menu. \n\nOn Monday the burgers are half off...I don't think you have to be a member of their mug club to get the special. However, if you are here regularly the mug club is great with free gifts and specials. \n\nhttp://www.rockbottom.com/MC \n\nNeedless to say I have a fun beer glass collection thanks to Rock Bottom...LOL! \n\nNow everyone favorite part about Rock Bottom's Beers! \nThe in house brew master keeps it interesting with a rotating variety of frothy yummy to try along with the consistant favorites of Ale, IPA's, Rotating Darks and Kolsch. \n\nStop by on Thursday nights for a colorful game of trivia where teams battle it out in a game of intelligence and drinking skills!","type":"review","user_id":"cF2CgY-_zNTBtQpaP_CeVw","votes":{"cool":3,"funny":0,"useful":3}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-06-05","review_id":"DratSiBUdnZFXTCXghtFLQ","stars":4,"text":"We've all had this happen to us - you go past a place one hundred times and never go on. Then, once you finally do, you realize how many opportunities you wasted!\n\nRock Bottom is definitely a solid bar. As a microbrewery, their beer list is full of house brews. There are better beers in the world, but there are a lot of worse beers out there, too. \n\nWhat really makes Rock Bottom standout, though, is the food. My girlfriend and I shared an order of nachos, and it took everything we had to finish them. They also make a mean soft pretzel. \n\nThe Waterfront may not be the most convenient thing to do while in Pittsburgh, but no trip to the Waterfront, is complete without a bite and a drink at Rock Bottom.","type":"review","user_id":"Y9J0JUfoY_xV_vCVnmLheA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-06-07","review_id":"nPCjClC3yS-ZFrOFsA9f9A","stars":5,"text":"I would have to say I'm pretty partial to Rock Bottom, I have been going almost every Thursday for the past 3 years because of the fantastic \"Team Trivia\". My friends and I love the atmosphere, the DJ (Todd), and the service that we get at Rock Bottom. \n\nEvery week when we go a menu is never needed because we pretty much know everything we want on it, except for when the change the menu from time to time and we get to have a special treat with something new! \n\nAs an avid Rock Bottomer, hands down I have never in my life had a better spicy spinach cheese dip than I have had here at Rock Bottom. Whether I have eaten dinner or not before I come down to the restaurant, my favorite and my food of choice is the ENORMOUS Ball park pretzels with the cheese dip. It is a meal itself! The mixture of onions, cheese, spinach and tomatoes is perfection! \n\nAnother favorite of mine is the Barbecue Chicken Pizza, it has a great kick to it and it's big enough for two people. \n\nThe service has always been super great and now since we go often we have developed a great relationship with some of the wait staff. \n\nA truly great place to have fun with friends and meet new people! \n\nCome to Team Trivia every Thursday at 8pm!","type":"review","user_id":"wF2GUprZUxRi2DIInefH-w","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-06-13","review_id":"ScnWaNLq7KpazJtCIxqfjA","stars":4,"text":"Rock Bottom on Thursday nights is the place to be. Team Trivia starts at 8pm and it is free to play. The DJ (Todd) is great. \n\nThe food is good, but the Ball Park Pretzels with Spicy Spinach Cheese dip is the best. The wait staff is generally pleasant and on top of things, a few servers are excellent. I am not a beer drinking so I haven't tried the microbrews but the mixed drinks I've had have been good and a few of thier specials perfect. \n\nOn nights that are not trivia nights, Rock Bottom is quiet and a good place for a small to medium party. Larger parties will usually be split into two tables. \n\nOverall, an enjoyable place at which I am a regular.","type":"review","user_id":"izrGea9JvRtmaTaQEwrO3w","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-07-14","review_id":"U01aVLcVAluYpbLJRGvNpA","stars":4,"text":"So I have not been to one of these in awhile since I normally have an aversion to chain restaurants, but since I was with colleagues on travel for work and they chose this place I went along. \n\nFirst surprise: decent beer.  I remembered the normal RB Brewery beers were not much to write home about but they had a couple of new styles, including a very good imperial IPA that for $5/glass cannot be beat.  Second surprise: pretty tasty food with a lot more healthy options than I expected.  Recommend the summer salad and the ahi tuna - both were great. \n\nService was a little slow (not sure why) so a 4-star review is downgraded to 3.5. I'll be back next time I'm in Pittsburgh for work.","type":"review","user_id":"1Nn58APYG7Qz1tRiqdGCng","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-07-25","review_id":"lUw1qLrY1VlcaCcKdpPN1w","stars":4,"text":"The beer is good. Their light beer, Lumpy Dog, is very good-- doesn't taste like a light beer. When I was pregnant I became quite a fan of their root beer floats, too.\n\nAs others have noted, the pretzels are really good. I'm not a fan of the spinach dip but my husband likes it. Veggie burgers are always good, too, though the staff sometimes seems confused when you order, say, the bourbonzola burger with a veggie burger. Long, long ago, when I used to go to the Rock Bottom in Boston, there was a hot mushroom / sundried tomato / cheese dip on the menu that was fantastic... if they resurrect that I will gladly add another star!","type":"review","user_id":"u7rJ_CFbp4IYeT39fNfVDQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-10-06","review_id":"yGmtV3aZmCMqKhefn3dPQQ","stars":2,"text":"I always feel like I am constantly bashing breweries for their food, but in my opinion, I feel the bar is raised for places like this. It seems there are so many breweries out there that offer great beer, and slack off on the food. Unfortunately Rock Bottom is one that falls into that category. Let's be honest, when you go to a brewery, you want the full experience. If it was only about the beer, I'd go buy a growler and take it home. \n\nSo, about the beer....EXCELLENT!!!!! The Jagoff IPA is with out a doubt one of the best IPAs I have ever had! They only I can think of that I think is better is Dogfish Head, but that's a matter of opinion. The beer selection is constantly changing, and they always have some excellent seasonal beers. You can't go wrong, there's bound to be a beer everyone will like. \n\nAs for the food.......it's pretty much a crap shoot. Sometimes it's good, sometimes it's terrible. My biggest problem is there is absolutely no consistency when it comes to the food. One time it's perfect, then maybe it's cold, or it's burned, or it tastes completely different from the last time you had it. Unfortunately, it seems there is zero attention to food quality. \n\nThat's pretty much it. This place fixes it's food consistency, and it's a five star place. Till then, it's hit or miss!","type":"review","user_id":"rrGE6D7KhnrEMV75Kj3g7w","votes":{"cool":2,"funny":1,"useful":2}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-11-01","review_id":"4j4WzIBLJY5mmD-mAoNWUA","stars":3,"text":"I was SO ready to like this place!  Turns out, not so much.  It was okay.  No better than TGIFridays, but better than Eat n Park!  The deets.\n\nThe hubster and I were here on a Saturday evening after a show at the Improv so we were happy and in a good mood and ready to enjoy some good eats.  We ordered drinks.  He a wheat beer of their brewing, me my fave Bloody Mary with Absolut Peppar.  The hubster deemed the beer acceptable, but wouldn't go out of his way to come back just for another one....yes, he DID order another one \"just to be sure.\"  My Bloody sucked.  Watered down tomato juice with no discernible Peppar of any kind, let alone any other seasonings.  Even a good standard mix would have been better.  Our very efficient and friendly waitress took it back and watched while it was remade by the other bartender.  Nope, no better at all.  That went back and I went with a you-can't-screw-it-up Amaretto sour.  It was fine.\n\nHub ordered a Reuben - why, I'll never know because they simply never measure up to the gold standard of what used to be at the long-lamented Gazebo in Shadyside.  You younguns wouldn't have a clue of the establishment of which I speak.  He said this one was \"fine.\"  I had the Texas Fire steak with jalapeno butter which I enjoyed very much!  Packed a punch of heat and flavor, but the sides were uninspired.  Steamed veggies.  Any flavor was steamed out in the process - eh.  Cheddar mashed potatoes - there was cheddar in there?????  No way!\n\nThe tab was reasonable - we DID have a Living Social deal that took $30 off, so our check was for $12 and change, not including tip.  Not bad (even with the $15 cost of the LS Deal), but had we paid full price, it wouldn't have been worth the experience.  We'll hit the Improv again - we have before - but, we'll head somewhere else afterwards.","type":"review","user_id":"jaDTgMqh4DzoLJrMrW3JcA","votes":{"cool":1,"funny":1,"useful":2}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-11-01","review_id":"JI8ogaD1Kgu2XrNLqvQcPg","stars":2,"text":"I must admit, I do like the brews.  I also like the white cheddar mash potatoes.  Other than that, meh.  The food is pretty forgettable.  Another \"brewery\" that sadly fails to be anything special in the food department.  With the restaurants upping the ante on 8th Ave, you may want to kick it up a notch Rock Bottom.  But how would anyone know to?  It's a chain.  Whomp whomp!","type":"review","user_id":"nEYPahVwXGD2Pjvgkm7QqQ","votes":{"cool":3,"funny":2,"useful":7}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-11-11","review_id":"d1H9RNbhrz4VGsIg3ecACQ","stars":1,"text":"For a brewery who is attempting to take advantage of Oktoberfest you wonder how at 7 pm they could be out of mashed potatoes & sauerkraut then a sausage platter with sweet mustard guess they have not been to Germany. Not worth $5.95 unfortunately the sausage platter was $15.95.","type":"review","user_id":"JVb5BRi7NSgXqVoMJCO0Hw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2011-11-28","review_id":"hvzFbHOUESYqJiat4EfFUA","stars":3,"text":"Dined in twice, food ok, atmosphere good.","type":"review","user_id":"vjcjHR3G_Vu-Ruo5JcLtWA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-01-23","review_id":"D5RqMgldgDatdrbRlP3l1Q","stars":4,"text":"I've always been pleasantly surprised with the food I've gotten at Rock Bottom.  I say \"surprised' because with any restaurant that falls into the slippery territory of a \"chain\", you expect to find your fair share of culinary duds.  But I've really had a lot of good meals at Rock Bottom.  Now, granted, you do owe it to yourself when ordering to not forget where you are (a \"bar-straunt\" if you will), and don't get anything above and beyond this place's call of duty.  For instance, I will never be ordering the ahi tuna.  I'll leave that to my favorite sushi bars and restaurants a bit closer to the water (the Mon doesn't count.....).\n\nBut besides that, I always really enjoy my meal choices.  I've recently gotten the chicken avocado sandwich.  Chicken was grilled perfectly, plenty of avocado, and it was a good sized sandwich without being excessive.  I've also ordered the Margherita pizza, which could definitely be split between two people.  It's an eight cut that comes to you on a big wooden pizza paddle.  The pizza was really great.  The crust was crispy, it had a good balance of cheese and tomatoes, and the basil pesto was fresh and tasty.  And not greasy whatsoever - BIG bonus points there.  But my biggest surprise as of late was when I ordered their chicken flautas.  I'm a HUGE Mexican food fan and always hesitate to order Mexican outside of a Mexican restaurant for fear of being disappointed.  But I had an insatiable craving one night and decided to go for it.  It was DELICIOUS.  The flautas are deep fried which gives you an amazing crunch, and they still managed to not dry out the inner ingredients.  The accompanying rice was nice and moist as well.  I was so happy!\n\nI've always been quite happy with the service there as well.  I go on Thursday evenings for trivia, and nine times out of ten the service is really spot on.  The ladies servicing the bar area are friendly and attentive.  Only once or twice, to my memory, has my service been sub-par, and that can usually be chalked up to an extremely packed Trivia Night with only two visible servers helping 50+ people.\n\nI definitely give Rock Bottom two thumbs up for taking your typical chain-found food and making it fresh, yummy, and worth coming back for more.","type":"review","user_id":"_Ud7sdn_khya8e2f3FNvWA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-04-04","review_id":"IxX2lLnreI2mI-UH-_Kayg","stars":2,"text":"I went to Rock Bottom this past weekend, and it was \"nice\" to see that nothing has changed in the year or two since my last visit. While the beer is pretty good, it has never outweighed the fact that the service isn't good and the food is average, at best.\n\nIt was even difficult to get beers at the bar...we tried to have the girls order, thinking they'd have better luck...when that failed, the men tried...that didn't work either. If we hadn't REALLY wanted a cold beer after a comedy show at The Improv, we would've just left. It definitely wasn't busy enough to be noticed and ignored by the bartender, so I can't overlook it. Of course, the service has always been spotty at Rock Bottom, so it was hardly surprising.\n\nCombine the weak food and poor service with Rock Bottom being too far from home for a night out just to drink, and you get the exact formula that's kept me from going there in the past...and will keep me from going often in the future.","type":"review","user_id":"sS2sSWqZMnQMRoWx-Mdzgg","votes":{"cool":2,"funny":1,"useful":3}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-05-11","review_id":"vLCoeCHkjtTqkuwGxl810g","stars":4,"text":"Happy hour at Rock Bottom, 2 thumbs up!  Good prices, the pizza is delicious, drinks are a few dollars off the regular price, good service, and the atmosphere is always casual and fun.","type":"review","user_id":"wtQsINapBJLhtfIe2xecpw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-05-27","review_id":"3WFAQdWoEAeJ08vQwUQvJw","stars":3,"text":"The only reason Rock Bottom gets 3 stars is because of the brews. Food was \"eh\", not many vegetarian options and hostesses who will ignore you because they are too busy chatting about who didn't text them back. This place has the potential to be great, but sadly, it falls way too short in almost all areas.","type":"review","user_id":"_e5drmTJBSV0yiFBrTimtg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-06-01","review_id":"eE6FcaevmEnuweEIddEwNg","stars":3,"text":"Watch the fat girls in here. They will try to steal your buddys chair in a sec if he goes to the bathroom & then the indignent fat girl had to get yelled at in front of everyone w/ in ear shot. Everything else including the burger & beers I devoured was excellent.","type":"review","user_id":"jhukBhC_BgGdBclC9kl7UA","votes":{"cool":1,"funny":3,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-07-01","review_id":"dGkkrX_leIXTEx7xphbtNA","stars":4,"text":"Rock Bottom was our first stop on a 17 mile pub crawl.  As expected, the bar was lively, the food was good, and the service was accommodating,  The beers are better than Church Brew Works and the bar was populated.  The bartender readily offered a taste of beer and gave us a hat to wear for the rest of the crawl.  \nI vote for Rock Bottom as the anchor store of the Water Works.","type":"review","user_id":"kRa-sZPizt2EqWYVFZ6DGw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-07-18","review_id":"itJQXnTjWYYUjZuxBp7cdQ","stars":4,"text":"I haven't been to Rock Bottom in years.  Maybe even decades...is that even possible?  Well, either way, it's been awhile.  So with my gift certificate I took my brother out for a birthday dinner.  \n\nAs I get older, my tolerance for things like crowds and youngsters gets lower and lower.  As a result, I told my brother to be ready by 4pm so we could head to the Waterfront before everyone goes out for date night.  Plus the Pirates were playing at 4:05 so we could enjoy our beers and the game.\n\nWhen we arrived, the bar side was already pretty packed but we were still able to get a table.  Our server was very attentive, friendly and helpful.  Right off the bat we both ordered samplers so we could try all of their beers.  We loved the fact that as she approached our table with a full tray of samples our server said, \"I have to go back for the rest.\"  In all we were served 10 different beers each (in 3 oz glasses, maybe 4 - I can never tell).  I gotta say, Rock Bottom knows their beer.  I liked more than I didn't, and very few were not to my liking.  So the $6.95 10 beer sampler was well worth it.  \n\nDuring our sampling we indulged on some Southwest Egg Rolls.  They were okay, but not quite what I expected.  The spicy ranch was top notch, though.  As we ran out of beer, we each ordered up a Kobe Burger.  They were both cooked exactly to our liking (medium).  And to top off our wonderful evening, the Pirates brought home a win!\n\nMy only complaint, as a beer drinker, is the cost for a growler.  The glass container itself is sold for $12.95.  That's the empty price.  To me, that's a little ridiculous when East End only charges $3 for the bottle and Penn Brewery $5.  Paying more for the bottle than the beer inside seems like insanity to me.  So I walked out empty handed.    But it won't deter me from returning.","type":"review","user_id":"9Ify25DK87s5_u2EhK0_Rg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-08-13","review_id":"27ammdgPLmlrVZPK0XoRfA","stars":3,"text":"I just came here with some friends to hang out and get some appetizer, and I have to admit that I was pretty satisfied with what we got.  Though I couldn't find any fried pickles or onion rings on the apps section, there were some blue cheese nachos that really hit the spot.  The atmosphere of this seems pretty cool, especially in the pub area.","type":"review","user_id":"bSkco4ZdB7REFtDsJUVrDA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2012-12-09","review_id":"KmWTidBvWTFH683yjE53CQ","stars":5,"text":"Fish tacos were excellent!! Great brewed beers on tap as well!!!!!!","type":"review","user_id":"1Vr1Sq8FGnP-8HuD79IhbQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-01-16","review_id":"jhQIaOzCvAjM92a39GcP3w","stars":4,"text":"I very much enjoyed my first visit here. I got the Turkey Meatloaf and it was really tasty. It's more sausage than turkey. The cheesy mashed potatoes were excellent. The star of the night was the appetizer, the artichoke and crab dip. It was awesome. My only complaint was I ordered a Red Ale and they were out. I had the Curmudgeon instead and it was very good, but still.","type":"review","user_id":"VSfPN4tGH4Tjd3JUu8yUew","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-01-23","review_id":"coGmwDUAGOWLplUe2slLTg","stars":2,"text":"Slow service\nBelow average food \nIll pass","type":"review","user_id":"i0aToSFRKd6PjF3dMY8JLQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-02-11","review_id":"hFkZo1pA6CJIAXnFgEJAmw","stars":4,"text":"First time I was here I had chicken quesadilla's and they were bad.  We went again last weekend. I had the chicken avacod sandwich.  It was very good.  No fat in the chicken.  Just a mess to eat, but still awesome.   Also had the chocolate stout cupcake, it was amazing.","type":"review","user_id":"-0MGEWw692xeqwmdvsnFZw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-04-09","review_id":"_ZuYEAeYwM0OfnrZJaSebg","stars":4,"text":"Thanks to the staff here\nFor being so friendly and\nCool with our whole mess*\n\n*rock bottom allowed our bachelorette party to eat and drink and hang after dave and busters orphaned us","type":"review","user_id":"2VqU7uoDeiE8OUL14Ce5Ig","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-04-13","review_id":"ZZS022Mm6y-sSiNVE7MdqQ","stars":3,"text":"Its not bad. I'm not into chain kind of places, but if you're with a group that doesn't do anything more adventurous, you'll do fine here. I vacillated between 2 and 3 stars but the house beer I had will make sure I come back from time to time.","type":"review","user_id":"8fApIAMHn2MZJFUiCQto5Q","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-04-23","review_id":"dcfraWBbOMz8CVQQg4tm1w","stars":4,"text":"Went to Rock Bottom for lunch the other day and was very pleased. My coworker had printed out a coupon for a free mini appetizer. The waitress told us that they were not making mini appetizers and gave us a full sized chicken quesadilla. If you have ever had the southwestern egg rolls from Chili's - the filling tasted like that and I am a big fan! \n\nMondays are half off burger days and I tried the just hot enough burger - topped with crispy jalapenos, pepper jack cheese, pico de gallo and housemade habanero ketchup. It was delish! The ketchup was so good and the fries were extremely crispy. \n\nThe prices are a little steep for lunch but if you go on Monday, it's totally worth it. I think that the quality of food more than makes up for it but don't expect for pay under $10 for a sit down. \n\nI felt that the staff was very nice and the waitress was very attentive. The service was quick and I think you can get in and out in under an hour.","type":"review","user_id":"ytgLwKzD6B4af5vW56RpJg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-05-19","review_id":"MmoH71NbSFF7KSKPIeD1Ug","stars":2,"text":"Rock Bottom is a chain brew pub one that, in my opinion, is just \"OK\".  The restaurant is rather large with lots of seating and a pool table. They have many of their own brews that you can sample but to tell you the truth none of them are that good. I have had several of their beers and all of them have been forgettable. \n\nTheir food is pretty much like their beers, forgettable. I have had one of their burgers and their pizza and they really weren't anything to write home about.\n\nI feel they will impress those who have never been to a brew pub but I would probably describe them as the Chili's of Brew Pubs. If you are in homestead and are looking for a burger and a beer it might be a good choice for a bite, or at least until the Burgatory opens!","type":"review","user_id":"Yvn7DHj7o7sSCH2rNH74Mw","votes":{"cool":1,"funny":1,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-06-02","review_id":"lE5xSKLsIBtv1SfJ9CHQBA","stars":2,"text":"Went here last night to meet folks for a friend's birthday party. Docking one star due to a few unfortunate things that happened, otherwise I'd be fine giving this place a 3.\n\nOur waiter was very attentive and kept our water and soda cups refilled, the food was decent overall - I had a plain ol' burger and a delicious berry sangria - and the place overall had a nice vibe to it and was pretty comfortable and fun to be in...you'd think this would just be another average place not-great-but-not-bad and I'd be ready to go on to the next review right there.\n\nHere's where I ran into problems. I'd checked the website in advance to try and plan my meal since I do my best to pick items on menus that aren't, say, 2,000 calories in one sitting. Their website advertises that they make skinny drinks; when I asked my waiter he said it was possible but that they did not normally do this and that it's a hassle for the people at the bar, so he didn't recommend it. Then why tell us on your website that you'll do it??? \n\nAdditionally, while we had checked in advance when we made our reservation about bringing a birthday cake and the restaurant's ability to handle us lighting candles, apparently there was a break down in communication; we never got the candles we had asked for, and in fact the poor waiter struggled to even find a lighter before realizing there were no candles available. Obviously whatever error occurred wasn't the waiter's fault, and we definitely thanked him and tipped him well for doing the best that he could with what he had.\n \nOn a final note, this is also one of those places where if you ask for a medium rare burger, they will overcook it; I've started ordering medium rare on purpose specifically so that I get a medium cooked burger instead of medium well or well done.\n\nFinal verdict: go for the brews if you must, and the food's nice enough. I was admittedly left a little underwhelmed.","type":"review","user_id":"DLu1Bum8EXNE62xno-v0VA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-06-08","review_id":"nqXl67u1jj8ZCKK0roWWvQ","stars":4,"text":"Mostly come here for the beer and sports. Fun place!","type":"review","user_id":"t5mr9snU8tI7hcjMSCYxLQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-06-17","review_id":"5XzkZUgPDNZ3WfZss6C-NQ","stars":3,"text":"Nothing special. Just like Applebee's, Chili's or Fridays. Stick to the bar food (burgers, sandwiches, pizza, wings and salads) and you will be okay. \n\nThis was our second attempt at trying Rock Bottom on Fathers Day. The first time almost ten years ago. We went in the early afternoon and they had already ran out of steaks. How do you do that on Fathers Day?! This time we went around 12 noon and beat the rush.\n\nMy wife got and loved the Berry Bash Sangria. She just said it had too much ice in it. Our daughter got the root beer float which she love and I started with a Mango Ice Tea, but later switched for a raspberry ice tea as the mango ice tea wasn't sweet enough.\n\nWe started off the the Kobe beef sliders as our app. It took at least 15 minutes to get them. You get three sliders and they were very good.\n\nMy wife got a small greenhouse salad with Jalapeno ranch dressing to start off with which she enjoyed and the lobster & shrimp enchiladas as her main entree. She complained about how salty it was and the fact that there was no lobster in it at all.\n\nOur daughter got the kids burger and fries. No surprise there.\n\nI ordered the New York Strip with mashed potatoes and it came with green bean as well. My strip was cooked perfectly and has a decent taste. Longhorn has a much, much better quality of steak though. The green beans were pretty good and my mashed potatoes very bland and pretty average. \n\nThe kitchen sounded like an live episode of Hell's Kitchen. The waiters were repeatedly asking for orders at least 5 to 6 times. The kitchen was backed up the whole time we were there.\n\nOn a different note, our waitress Susan was very good. Come here for drinks and the bar food. Skip everything else.","type":"review","user_id":"fwsJGulnozT2U6FefsLiFw","votes":{"cool":1,"funny":1,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-06-30","review_id":"C6DdlsBFmIzxZScxwNBqXw","stars":4,"text":"I go to Rock Bottom pretty often for dinner or their awesome beer, so I was really really excited to have my bridal shower there.  My maid of honor reserved the banquet room which was very nice and separated from the rest of the restaurant.  My MOH and mother said that the person they talked to about reservations and arrangements was wonderful and easy to get in touch with.  My shower was wonderful, the wait staff was great and kept everyone's glasses full.  It started pouring down rain and they let us stay a little longer so my gifts wouldn't get wet when taking them out to the car.  The only reason this place gets 4 stars is because we were not allowed to take our leftover food from the buffet home.  There was salmon, chicken, potatoes, and mac and cheese left over and they told us we couldn't box it up.  Not sure why- they can't re-serve it!  It would have just gone to waste!\n\nAlso, not at all related to the shower, their trivia night is super fun!","type":"review","user_id":"N1colY77TPM51Q2HIx46Fg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-07-17","review_id":"b-ijQwqWF2wEZ2VStaT_kw","stars":5,"text":"Southwest Egg rolls and Fish tacos. Mmmmmmmmm. Ohh and the AMAZING Brews!","type":"review","user_id":"p8z32LHEzVlrY42oS4la_A","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-09-30","review_id":"bIKl9fNOzHaHiWpYvyNFDA","stars":4,"text":"I'm giving 4 stars mostly because of the beer....large selection & decent prices.   The food is pretty good, but nothing to rave about.  The menu has a good variety, and everything I've tried has been good.  Portions are large.  \n\nOne side of the restaurant is the bar & bar atmosphere....with several TV's & 2 pool tables.  It's very wide open with extremely high ceilings.  The other side is more for families or people who aren't concerned about watching sports.  In general, it has a relaxed atmosphere.  I've always had quick & friendly service.  \n\nI love the whole Waterfront area....so much to do!","type":"review","user_id":"ri9L-HZ_0fUJgALY4vCz7A","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-10-13","review_id":"TdZUlpu8Pbzddp1dTXmjCA","stars":4,"text":"I'm not much of a beer drinker, but my fiancee is a major enthusiast, so I agreed to tag along.  I'm glad I did!  Our waitress was very knowledgeable about the extensive house-brewed beer selection, and helped me to pick one I would love (the kolsch was very crisp, light, and drinkable.)  The food was standard pub fare with a twist, well-executed.  My burger was topped with onion petals and gorgonzola, and cooked to perfection.  The waitress recommended their macaroni and cheese for a side, which was definitely a good choice.  My only complaint is that most of the food was rather heavy, and I spent the rest of the night wallowing on the couch.  Not sure I would make the hour+ trip to Pittsburgh again, but if I found myself in the city, I may just stop by.","type":"review","user_id":"ivErlAt_FqAgaDUuDHQMcQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-10-15","review_id":"1zA6E42lsskpOyKHByEdwA","stars":1,"text":"Came with my BF we started with the crab artichoke dip. It was very greasy and had virtually no crab. The wedge salad was good and crisp. I had the hazelnut crusted chicken. This has to be one of the worst dishes I've ever had it was like pancake syrup over breaded chicken. To finish the meal we had the homemade chocolate chip cookies served with hot fudge. Well there was no hot fudge it was chocolate syrup the ice cream was so crystallized from melting and re-freezing all around disappointing.","type":"review","user_id":"tC62PSePYtPwSKc6Asf7rQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-10-24","review_id":"3mp5jXdxC2yqSK6sgRQfEg","stars":3,"text":"Normally the food is outstanding, no more salted bread sticks, but they did bring back the ball park pretzels.  Not very good, cool to low warm. Hard, dense.  Mango ice tea is wonderful.\n\nWill see how the chicken comes out.\n\nTo be continued...","type":"review","user_id":"bEIXIfk1Zys1r_nmGNiF9A","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2013-11-10","review_id":"cx-uK63Pl7gBAsz0lUiDBw","stars":3,"text":"Tom and I decided to try this place out before catching a late movie on a Saturday night. He is a beer buff, and neither of us had ever been there, so we gave it a go.\n\nWe walked in around 8pm and we were told that there would be an hour long wait. We put our names on the list and went shopping around the area. About 25 minutes later, our table was ready. Parking was a cluster since the lot is shared with Dave & Busters and a karaoke bar called Sing Sing. Tom dropped me off at the door so I could secure our table.\n\nOur server, Jackie, approached me almost immediately and brought two waters to the table to start. She was very attentive and funny, and probably the best part of our experience at the restaurant. Tom ordered a Red Ale and to his surprise, didn't care for it. Jackie gave Tom three free samples of beers she thought he would like after talking to him about his beer drinking habits. He loved all three, and chose the most bizarre (and expensive) beer. Jackie switched the Red Ale to the beer of Tom's choice, and charged us for the less expensive beer. Very nice of her!\n\nWe started out with the Ball Park Pretzels with Jalapeno dip. The pretzels came out quickly and they were very fresh, not to mention huge! We only ate one and took the other to go. Very good app though! \n\nTom ordered some sort of bacon cheeseburger, and I got the Chicken Fried Chicken, which was a pounded chicken breast, breaded and fried, over white cheddar mashed potatoes with a side of gravy and some apple coleslaw.  Tom's burger came with a small handful of fries, and my meal was very spread out on my plate, like something was missing. Not very good presentation at all. The food itself was okay, nothing to write home about. The potatoes were my favorite part. Tom said that his burger was mediocre.\n\nAnother note: The bathrooms are shared with the Sing Sing karaoke bar that is in the same building, so expect drunk singing women in the bathrooms and brides-to-be puking in the stall next to you after enjoying too much alcohol at their bachelorette party... Yuck.\n\nOverall, we might come back for the beer and service, but not for the food. And DEFINITELY not to use the bathroom...","type":"review","user_id":"pNIud6KW96svNcvb2WQ-XQ","votes":{"cool":0,"funny":1,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-01-09","review_id":"lFI6moIfSeLRtAIfS0oA0w","stars":4,"text":"I'm a regular here since their kitchen is open late and it's a good option after movies. Their nachos is pretty good. I also tried their burger and chicken sandwiches and they're good as well. \nI think the only thing I did't like is the steak taco appetizer. It was too sour and kinda tasteless.","type":"review","user_id":"5UCdxI_krbnv7_7Q3Ur_eQ","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-01-09","review_id":"BvtJqv4xK0kUDYal-6WI9g","stars":4,"text":"The Cajun Pasta I ordered was just spicy enough to keep me sipping my Rock Bottom IPA. It may be a chain but I always get that microbrew restaurant feel when I'm here. They could upgrade the quality of the servers but I've never had a really bad experience with the service.","type":"review","user_id":"I-jk9_xWCV3zfDqwrIJDSQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-01-17","review_id":"d1RMbWi3t7SdHRLziqCJ5w","stars":4,"text":"I really miss the Northstar Amber but the specialty beers are always good.  Food is excellent and the service staff is friendly.","type":"review","user_id":"W9ZG5q-QIblXYeHgaPS5Uw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-01-22","review_id":"YXRTA4I09YOXx_zCfsPEwA","stars":2,"text":"So after an evening of enjoying a comedy show at the Waterfront, we headed to Rock Bottom for some late night grub.  The place was pretty busy, we had to walk around the bar area for several minutes until a nice couple told us they were about to leave and we could have their bar table.  As nice as this was of them it was awkward standing over them as they finished their drinks paid their bill and left.  \n\nSo finally seated I look over the drinks and being the huge IPA lover that I am I went with that and it was indeed a good choice.  The hubby had the Red Ale which was also rather good.\n\nThe service was OK, not the best not the worst.  But moving on to more important thing, the food.  Talk about missing the mark hugely!  I ordered the mini street fish tacos.  You get four mini tacos with a marinated in lime piece of fish, and tomatillo salsa.  They were just strokes away from inedible.  I love fish tacos, I mean it is such a simple concept so why do people have such a hard time executing this dish? The shells were hard and literally split at the bottom when I picked them up.  The sour cream sprayed all over the plate only made them messy and the poor fish was just so overcooked.  If I wasn't so hungry I wouldn't have eaten them at all! Lesson learn on that.\n\nThe husband had the BBQ Chicken Pizza.  It had beans and corn with roasted red pepper on it along with some sour cream.  My husband is usually the type that will order these lovely specialty pizza's and ask for them to remove all the wonderful unique toppings!  For instance, he would usually just say, Chicken BBQ and cheese, nothing else!  I refused to let him do that this time, because I was really intrigued in the combination of ingredients on this pie.  And boy was I jealous when it came out.  It blew my crappy tacos out of the water!  Should have stuck with something simple.  \n\nFurthermore I could care less if I come back to this location.  The beers were good but hell you can get a decent IPA just about anywhere anymore.  And the underwhelming food sealed the deal.  I know this is a chain, but it still doesn't have to stink...","type":"review","user_id":"2rSeth60_CuWN3ZJ4k41lg","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-02-17","review_id":"HLsReg2KinrvRh8nNRfq2g","stars":5,"text":"the food was delicious. portion size generous. atmosphere good. Our waitress Lindy was outstanding. Have nothing but good things to say. Would highly recommend to everyone !","type":"review","user_id":"MNSjtwY2H5cjwqKzCJRIDw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-02-19","review_id":"ToT3c7UGNTicg-s8Nw4Glg","stars":4,"text":"Another good meal ... this time the Housemade Meatloaf. It's a blend of turkey and sausage instead of the standard ground beef. A refreshing and delicious twist on a comfort food staple. Served over cheddar mashed and mixed veggies. The server could have behaved like she wanted to be there but everyone has a bad day once in awhile. Service was prompt just the same. Overall good experience.","type":"review","user_id":"I-jk9_xWCV3zfDqwrIJDSQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-02-28","review_id":"_C-mW34j7c5CcTEST7EJEw","stars":4,"text":"I have to say that I've only been here when it was very busy. I found the service fairly quick and any of the food I've had has been delicious. I went there tonight and there was an issue with my food. Without going into detail, I will say they handled it wonderfully. Our waitress Mallory was very kind and she was quick to fix the problem. I had the salmon for the second time and it was just as amazing as it was the first time. I had one beer that's similar to a blue moon and that was good too. I would go back again!","type":"review","user_id":"p3MF38R3Htt3ZWyPJMTFgQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-03-30","review_id":"9CFxmp_1HB-ZZkdvP5of5g","stars":5,"text":"My husband and I got here a couple times a year.    Always (except my veggies today) get great food at a decent price.   I love their side salad..... which has raisins and sunflower seeds.    Burgers are great and my husband loves their chicken Mac and cheese.   Recommend to everyone just get there early for a seat.","type":"review","user_id":"9b6REasjDBQAYDpXcKQ2NQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-04-10","review_id":"HhPEod3nZWCcwpPwxexlew","stars":1,"text":"Poor service and food. I waited 20 minutes at the bar for someone to just acknowledge my presence. They finally brought my food out and left it without asking for me to pay.... So I had to wait an additional 15 minutes to find someone to pay. Yes, I had to TRY and give them money.\n\nOn to the important part... Food was terrible. I had a burger and it was pathetic.","type":"review","user_id":"_mToBObzitXvOwCvlJ0NNw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-05-12","review_id":"cshZWbLvnfB61SW1icOV2A","stars":5,"text":"On a glorious day in the month of May , my love and I stumbled hungrily into rock bottom.  Ha. Just kidding I realized Darren W. Hadn't reviewed here so I had to start it cheesy.  \n\nThe rock bottom line: Monday for lunch we had awesome service by Ashley.  We weren't rushed and it was quite.  The burgers were great and half off . The beer was very good.  We will be returning for sure.","type":"review","user_id":"sN5hd2VEOaoBK_W0theW_Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-05-27","review_id":"cklStwXSasI7mrne71-gFw","stars":5,"text":"Planned a surprise birthday party here for my wife and they did an amazing job helping to pull it off! Service was extremely helpful, professional, and on point all night. Lauren (one of the managers) was reliable and pleasant throughout the entire planning process. If anyone is looking to plan an event I would highly recommend Rock Bottom. Couldn't be happier!","type":"review","user_id":"2IgUSmuW0oZVxwwCZmM2wA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-06-05","review_id":"P51zca5KqBsYXtTdH8y1Qg","stars":5,"text":"I love this restaraunt. Rarely have I ever received service like I get here. The food is good, definitely reasonable for the price. The thing that blew me away was the fact that my steak was cooked TO TEMPERATURE. This rarely ever happens at restaraunt of similar price range and quality. But the servers are fantastic. Very attentive, polite and timely. The beer selection is awesome, we always order the sampler. I like having lots of options as far as beverages go. The wait time isn't terrible if you go a little later on a friday or Saturday night. And they most often call you before the quotes time. The desert menu is a little small, but I could probably skip it anyways ;)  the ambiance is good, not to crammed or noisy. They also have outside seating available when the weather is nice I highly recommend this establishment!","type":"review","user_id":"PnlhfJ_mUpdHBGbhQZ_Ucg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-06-29","review_id":"a4n9TctxdgoVa_dkybxnOQ","stars":5,"text":"I love this place! Great food and the best beer brewed on site! The bourbonzola burger is the best thing you can order here.","type":"review","user_id":"DSXekZAu_BeKmqYaRyNfmw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-07-06","review_id":"nzMEk0eEiNzLNbcrAToRMg","stars":4,"text":"The staff here is very nice and the set up has TVs all around the family so enjoy mostly all sports, the music is nice and pretty mellow and the place is very spacey and the prices are pretty reasonable. And most importantly is the place seems to be kept clean at all times.","type":"review","user_id":"Ofk843AUiVWxtNEoH0QFow","votes":{"cool":1,"funny":1,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-07-18","review_id":"Tk_P6FIfXYb4kMSL2DYJHg","stars":4,"text":"Good food and large portions. I ordered the Veggie Burger for $8.50 and I loved it! It's one of the most unique veggie burgers I have ever had: a homemade patty of beans, rolled oats and veggies. The chipotle mayo really gave it that oomph. My burger was more than enough for me to handle and everything was worth the price. As for drinks, I'm a complete noob when it comes to beer but my friend ordered a tap and even from a small taste, I could tell it was very good quality beer. Bitter and sweet, with a slight tang. I rarely drink beer but i I'm going to, then might as well drink the best kind there is - fresh and microbrewed.\n\nNOTE: There aren't too many options for vegetarians. The veggie burger was pretty good and I'd recommend it, but other than that, there's also the veggie tacos, a few select appetizers, and a few salads from which to choose.","type":"review","user_id":"P1F3B8GinmPx_NuwmkqVdA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-07-21","review_id":"jZavg-_EkyumHwBBUy8Z6Q","stars":4,"text":"I've never been crazy about the food here, but my friend likes it, so I do eat here once in a while. We stopped in last night and I had the chicken finger appetizer with fries. The food was a little overcooked and nearly tasteless. The ranch dressing was barely good enough to make up for it. \n\nMy friend had the mac & cheese with chicken and bacon, which is what she orders just about every time she's there. It looked delicious and the portion was huge. I'll be trying this dish next time we're there. \n\nWe've also had the Ball Park Pretzels in the past, and they're really good. \n\nI'm giving 4 stars because the service was great, there's outdoor seating, and the Berry Bash Sangria was delicious (if expensive). We'll be back.","type":"review","user_id":"qZbgGiWIi52GL7o3ot5ckw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-08-09","review_id":"5TCjLUnu3DpXWGbdP40EOA","stars":4,"text":"Every time I've been here the food has always been delicious and the service has always been very exceptional. My go to is the Laredo burger and the Mac n'cheese as a side. They Mac n' cheese is absolutely wonderful if you like garlic! I've had a few other menu options as well that have been superb. The beers on tap are always great. My newest favorite is the First! Pumpkin Ale. \n\nOne thing I really appreciate about Rock Bottom is that they aren't one of these restaurants that try to rush you out when you're done eating. The food comes out fast (which is great when you're starving!) but if you want to stay an visit with your date or eating companions there's never any rush. I was just at Rock Bottom last night meeting friends for a movie that didn't start until 11pm. We got at the restaurant around 7:30, ordered drinks, ate and had a few more drinks and then just hung out for about a half hour until it was time to Walk over to the cinemas. It was nice not feeling rushed to leave as soon as we stopped ordering.\n\nMy only complaints are that sometimes meat ends up being cooked a little more than you often ask. Medium often turns into medium well, but that's not a huge problem for me. I also don't think the signature cocktails are worth $9, but that's more of a corporate complaint since Rock Bottom is a small chain. \n\nOverall I definitely recommend eating here if you're in the Waterfront!","type":"review","user_id":"op2Gve4sAMQ4qEzq2Tad0g","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-08-16","review_id":"7ZUADKFVGf1mvcm-wcpjAg","stars":2,"text":"The food is standard American fare--a bit overpriced in my mind--and the beers range from mediocre to very bad.  The Klsch is the only decent beer of the bunch.  The service is good, but the wait for food or a table can be quite long (generally 20-30 minutes even for just beer and apps).  I've been to the one at the Denver airport as well, but I was stranded and had free meal tickets, so okay-but-nothing-special pizza from Rock Bottom it was.  Since it's a recognizable national chain, I think of places like this as more of a tourist brewery rather than a true Pittsburgh craft-brew experience.","type":"review","user_id":"N_cH3QA_eXXmnzz-nzEeKA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-09-12","review_id":"4hiuu3hbAaXtDS5pasBynQ","stars":2,"text":"The beer is good but the food is nothing to brag about at ALL. I've tried many things on the menu, and if you have developed a \"foodie\" palate, don't even bother, because you will be very disappointed. If you feel comfortable with chain restaurants and their lack of innovative touch (which, nothing wrong with that!) you will most likely enjoy Rockbottom. The only entree I did enjoy were the lobster and shrimp enchiladas (minus the repulsive beans and rice) and the asiago crab dip as an appetizer. Otherwise, you are better off skipping it.","type":"review","user_id":"jEJYKnFHHXzHlESRAlSl2g","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-09-23","review_id":"byWqoXfCxEcjZv8Pb_VQiQ","stars":3,"text":"This place is quite big with a bar area, dining room area, and patio area. We decided to sit in the bar area so we could watch some football on one of the many TV's. They also have darts and two pool tables, which I really enjoy. When you are in the bar area you can see the beer being brewed through the window which is really cool. \n\nI ordered the hibiscus wheat beer and my friend ordered the white wheat, both of which are brewed by Rock Bottom. They both tasted delicious and were exactly what I needed for a hot day. My friend ordered the Fried chicken entree which came with mashed potatoes and of course she gave me a few bites since we always share. It was a pretty delicious meal, but the fried crust fell off a few pieces which I am not really a fan of. I ordered the Sante fe salad with grilled chicken not fried. The salad was okay I was expecting more flavors overall, but I didn't really get them. \n\nIt was a good experience and will most likely be back when I am around the waterfront area.","type":"review","user_id":"SlKJNLm1SQdgaaKtqD--1w","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-10-22","review_id":"KOPFbqbt8D2swZX30SISkQ","stars":4,"text":"I am not a fan of chain restaurants typically and had to slowly break my boyfriend from wanting to eat at chain restaurants all of the time. The one chain that I can't break from is rock bottom. \n\nTheir beer is always good- as far as their staples go, I really love their white ale. Their seasonal IPAs have been good and my favorite seasonals of all time included their chocolate raspberry stout (...yes, it tasted as good as it sounds; they had it last year around Christmas) and their smoky BBQ brown ale (tasted like summer, complemented BBQ amazingly ; they had it this past summer, I bought a growler of it lol). \n\nAs far as their food goes, I typically stay away from the appetizers. $10 and up is a little too pricey for me as far as appetizers go. I've had their southwestern rolls and they were good but not worth $10. \n\nAlmost every time I go I order the Baja chicken sandwich. It's my favorite chicken sandwich! So good. The chicken is actually grilled (which goes for all of their chicken sandwiches) and I love the charred flavor that it has. The bun is soft but sturdy and doesn't fall apart while eating the sandwich, the sauce is amazing, the onion frizzles are the best and last but not least... There's a half of a fresh avocado on this sandwich. Mhm! I love it. My boyfriend usually gets the hickory BBQ bacon chicken sandwich and loves it as well. \n\nAnother item I ALWAYS get... Their apple coleslaw. I've yet to find better coleslaw in a restaurant. So simple, yet oh so good. \n\nThey also recently changed their fries and these are much better than their old ones. \n\nTheir side salads are awesome as well. They are decent in size- spring mix topped with sunflower seeds, raisins, half of a hard boiled egg (which I give to the boyfriend), chopped cucumbers and tomatoes and croutons. Yum! \n\nI usually order the same thing every time I go. I steered off my normal path once and ordered the buffalo Mac and cheese and found it to be quite tasteless. Which turned me off to trying new items there. Plus I am just too in love with the Baja chicken sandwich and apple coleslaw to want to try anything else. \n\nService is always great, the bartenders are friendly... I love this place. Ask about their rock bottom rewards !","type":"review","user_id":"MSuyK2p8G9hEqyWf5IgnYQ","votes":{"cool":2,"funny":0,"useful":3}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-11-01","review_id":"fGnSvtpSlyNnDuE3W3AIqQ","stars":1,"text":"Be careful. The servers can't pay attention to save their lives, and the management cares even less. I want to make sure people know how careless the management is, particularly Mark who seems to let his staff run around.","type":"review","user_id":"ihZulJIQ88ebAZXlpO0P1Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-11-28","review_id":"F3zL378ovxF9kLTPh3RyaQ","stars":4,"text":"I always enjoy Rock Bottom. Standard beers on tap are always great and their rotating selection usually has a hit as well. \n\nI prefer the bar seating as to the dining room, but this is a good way to separate the family dining from those of us without kiddos. \n\nNachos, nachos, nachos. Truly the best in the area. Great burgers, chili and salads. Really...I don't think I've had a bad meal here. Nice outdoor seating in the summer. \n\nThis is a great place to watch a game or just hang out. Iced counter at the bar to keep your drink cold.  I know they have other cocktails here, but I can't order them at a beer place. I've seen them and they do look good, but I'm stuck to the beer selection. \n\nThey have a great happy hour and specials throughout the week. \n\nService is always great whether there are two or 10 of us.","type":"review","user_id":"JPPhyFE-UE453zA6K0TVgw","votes":{"cool":1,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-12-04","review_id":"iY4mMXaurJkQru9WrzN9JQ","stars":3,"text":"This is  a \"Okay\" place to eat.  The food is nothing special.  I guess what they have going for them is the beer.  Order the  Guacamole for the starter which was okay but for $8.50 and the portion was not worth it.  Rice (Cajun Taco) was not cooked well.  Would I go there again \"maybe\".  If your into beer and watching the game, then yeah go there.","type":"review","user_id":"r99gQXj37f7Q8U1cnA5mJQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2014-12-16","review_id":"4nz3-E37XApHQhPRbsL8rg","stars":5,"text":"BALL PARK PRETZEL-Would eat again. \n\nI came to rock bottom, looking for a great beer. Full of hops, that brings a refreshing sensation and satisfaction. I then opened the menu, scanned looking for those select bar items to pair with my great beer. I saw an extensive list of items, from chicken fingers to salads. I noticed a Ball Park Pretzel, with a jalapeo cheese dip. I was blown away, the fact that I got 2 pretzels amazed me. I ordered within 25 minutes of seating. My pretzels hit the table within minutes. The smell of the warm salt and hot cheese opened my senses. But I knew we could step this shit up, I asked for mustard. And what do you know. Grey Poupon Dijon Mustard is in front of my eyes. I combined that shit and life evolved. I went to heaven, it took me 35 minutes to write this review because I took a solid bite with Grey Poupon after each sentence. Good look Rock Bottom, keep up the good work.","type":"review","user_id":"C4Oh_pJGOmsFVkHTMYG4tA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-01-15","review_id":"J37Iy29oZK0ejzSFYJ5QIg","stars":4,"text":"We have been going to Rock Bottom for sevesrl years and Love it! It is our go to place, when we want a nice meal, in a nice atmosphere,  with good service! We have had 1 maybe 2 not so great visits but for the most part, service is EXCELLENT and the food is consistent!  After leaving another restaurant (just trying to do something new for a celebration) because of poor service, we were greeted and seated in a few seconds!  Our server was at our table within seconds even though she had a large (10 to 12 guests) Group at the table near us. We had our drinks in minutes and were checked on twice within 5 minutes. Our food came out rather quickly and was delicious! Our server was very attentive and social. As usual, a save by our go to place! I know we will retun here again!","type":"review","user_id":"xloDzLt9w-1jQyegsvkBGQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-01-17","review_id":"cEa5s-us8j36gymIe_d7OA","stars":5,"text":"My husband and I went to Rock Bottom Brewery last night for the first time and we had a WONDERFUL experience! Our server, Amanda, was very attentive, and was able to make several good beer recommendations to my husband. My husband said that his burger was the best one he'd ever had, and my pizza was delicious! Prices weren't too bad either, especially considering how amazing the food and the service was. Rock Bottom is now on our list of favorite local restaurants and we will definitely be visiting it again in the future!","type":"review","user_id":"bOxBCFc6q7lXl7LBIPGvSw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-01-28","review_id":"BqcMewDQfVWa2pKTFFO4vg","stars":3,"text":"Nice enough chain restaurant.  Have ordered the fish tacos appetizer and the dinner entree of cajun fish tacos which comes with black beans and rice.  Both are ok, though I think I'd order something else next time as I'm pretty picky about fish tacos.  \n\nThe appetizer tacos were rather dry.  The cajun tacos were much better but executed oddly.  They come in 2 shells -- an inner hard shell and an outer soft shell.  Why might I ask?  Why add extra calories for something that seems so unnecessary and doesn't add to the dish in any way.  \n\nOh, well.  Can't speak about beer here as I'm not a beer drinker.\n\nThe space is pleasant and our server was efficient even if the meal wasn't the quickest to come to our table even though it wasn't busy.\n\nWould I revisit?  Probably; it was decent enough with many other menu options.  Keep in mind, however, that there are many options nearby worthy of a visit.","type":"review","user_id":"gtJJBaQwTwE45NnNF0coVA","votes":{"cool":1,"funny":1,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-02-15","review_id":"pOlwzyoewptzCGMowayqxQ","stars":3,"text":"Standard issue Rock Bottom.  We ordered the nachos....they could have easily served 6 people.  I have never seen a more massive platter of food.  Bar service was okay...guy working there was nice to talk to about sports.","type":"review","user_id":"5SLDX3bXcRP52QlStIcYLg","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-02-21","review_id":"sUoZDVRbW7WZJw2Ry4KS4Q","stars":4,"text":"On a Friday I went to Rock Bottom with some friends for their happy hour which takes place from 4-6. Our server was a spunky brunette who was very attentive and even let us sample as many beers as we liked until deciding. I ultimately decided on the Pom-berry Cosmo which was excellent. I also got the ball park pretzel which is amazing. During happy hour it's only $5 and you get two big pretzels served with this delicious cheese dip. My friends got the nachos, the quesadilla, and the artichoke cheese dip. Everything was very tasty.","type":"review","user_id":"m9kYeXySjEtZ6HvH_ATN_Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-02-27","review_id":"iAUUa19w8_RxWX2QFmsJow","stars":2,"text":"For this occasion I was with my girls, we were looking for a place to have a good lunch.  We looked around and chose Rock Bottom, we have eaten then before and enjoyed ourselves.  The server was a very nice person and was very attentive.  She when over the specials and took our drink order.   Going through the menu one thing that caught my eye was the BBQ Brisket Stuffed Burger.  That just sounded so good.  Unfortunately the reality didn't match the idea of the burger.  The favor of the BBQ never came through and the smoked Gouda flavor was none existent. It was like having a standard old boring burger.  I was very disappointed.  For $14, I would have expected a lot more flavor.  I would not recommend this burger unless they do something to bunch up the flavor.","type":"review","user_id":"BbT_ZMLkyUN0T_TBeBA7Kg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-03-04","review_id":"NfV3GJYB2oEXI5iw6K8rWQ","stars":4,"text":"Went to Rock Bottom at The Waterfront over the weekend with 10 adults and 3 children in high chairs. Service was good, efficient, and fast. I enjoyed a good bowl of tortilla soup and an order of Buffalo wings. Both very good. From the table, I heard rave reviews of the Ball Park Pretzel the other meals including a 2 alarm burger, a few classic burgers cooked medium as requested, mac n cheese, and lobster and shrimp enchiladas.  A very good experience.","type":"review","user_id":"e9WidSgUJQxAzTZ9C7JEHQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-03-23","review_id":"l1IOobjEbiqf7r2JXjUxlg","stars":3,"text":"My visits here are generally pretty consistent.  I love getting the beer sampler even though I've drank all the beers twice over.  I wouldn't say I have a favorite dish here yet but the food was always generally good.  I guess one thing that sticks out is the chicken mac and cheese and the Reuben.  \n\nWhen I go here though, I'm going for the beer more than the food.  Definitely worth a trip for dinner.","type":"review","user_id":"4DrkZqFqLcyRcLWuQUXFeQ","votes":{"cool":1,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-03-29","review_id":"BZxWKFWwP1lunolyT5WeSA","stars":4,"text":"First, I have to say that I've been here twice in the past few months, and each time was with a very large group (one group of 20, one group of over 30) on a weekend evening and I'm thoroughly impressed with the friendly, efficient and professional manner in which the accommodate groups. Whether increasing the number of diners at the last minute or providing separate checks, they are flawless. Lots of other restaurants could learn from them. Impressively, even with providing separate checks to such large groups, they chose not to add gratuity (and we obliged with good tips), l managed to deliver food to everyone at the same time, and processed payment of the checks in no time at all. Bravo to this restaurant's management and service staff, it's top notch.\n\nThat being said, the food and beer aint all that bad either! Fish & Chips, chicken mac'n cheese, salmon bites, guacamole and the Maker's Mark burger are all quite good, as are the beers (the Klsch is my favorite!).","type":"review","user_id":"rMyWUoG0X-3Q1GRVw4i_bw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-04-11","review_id":"u0nmdpEatfbfcs4j3fKG9w","stars":3,"text":"There are few local restaurants as popular as this place, the food is consistently good and the service always great. I meet people regularly at the bar, we usually have dinner but lately that's not always the case. The biggest complaint is that it seems the chef is intent on putting black pepper or some type of hot spice in all menu items.","type":"review","user_id":"6MNAoR1XEY9cVQpwZcBV_Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-04-25","review_id":"7CjQ6xXw_xeimDjCknBuYQ","stars":2,"text":"Overpriced. Food is OK, but way overpriced. Quantities are small....much smaller than the picture in the menu. The beer is average. But yes, you guessed it, that's overpriced too.","type":"review","user_id":"VGtI7xcuurVBQTbFNNsh4Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-05-03","review_id":"EWz5E5u15q3D4KKSrOPORQ","stars":3,"text":"It's been a couple years since I first reviewed Rock Bottom, and while I still don't love the place they've definitely improved since then. They admittedly still aren't my first choice food-wise because, by design, they're a pretty generic eatery for the most part, especially compared to other options in the area. Their local brews are really the only thing that sets them apart from other places in the Waterfront, and Pittsburgh has so many breweries and so forth now that even that isn't the biggest draw anymore.\n\nThat said, their brews ARE usually quite good and worth trying. Plus, they ARE improving in terms of service and quality of food, and that deserves a mention. Sure, I may think their menu of burgers, pizzas and American eats is pretty average, but I also think the quality of the dishes is improving. For example, my burgers are no longer coming to me overcooked, and as a result actually taste like a burger and not like a pile of toppings and a dry meat patty. Some dishes are even more memorable now; I actually really like their veggie burger, which is packed full of flavor that even I, a known carnivore, can appreciate. And their fresh pretzels and dip? Absolutely amazing - exactly what you'd expect from a warm pretzel fresh out of the oven. \n\nI was especially impressed during my last visit by a server named Mark, who was incredibly attentive and came to our table regularly to check on drinks and keep us updated. He never said a negative word and was quick to correct any mistakes or problems that popped up during the night. If Rock Bottom hires more people like him, there will be many more happy people coming and going from the place, I guarantee it.\n\nAdd in the fact that this is one of a small handful of places that accepts reservations in the Waterfront - a MAJOR plus when planning big outings with friends in the area! - and you have a reliable place where a group of people can go after a movie, shopping, etc. for food and drinks. And for that, Rock Bottom's earned another star in my book.","type":"review","user_id":"DLu1Bum8EXNE62xno-v0VA","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-05-09","review_id":"_sxILn7Y8AWV6g6U-DZCQw","stars":2,"text":"Was hoping for a great end of a day experience, but...... Things happen. Waitress seemed to have forgotten about us, entrees came out prior to our appetizers. Entree of fish &chips was a major disappointment, fish was soggy and the chips were cold and grainy.starters were comp'ed but I doubt we'd go back. Sad because it has the potential to be a home run hitter. Two stars and that's it.","type":"review","user_id":"5cfBDSfXlFExiMBqmGeObQ","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-05-12","review_id":"-wwv-TVwFri3YomBqYISpg","stars":2,"text":"Rock Bottom: A Cautionary Yelper's Tale.\n\nYou might say, \"I've never heard of Rock Bottom, there's no way that they are a chain restaurant.\" Beer? Apps? Bros? Sounds like a good time, but be careful or you'll end up on the rock bottom.\n\nAfter a 30 minute wait staring at half of an empty restaurant with the usual goofy decor you would find at a Buffalo Wild Wings, we were finally seated. We could feel the tension from other diners that something wasn't right. The manger was running around apologetically and the food was casually sunbathing under the heat lamps. We immediately ordered a few apps but just like GOT, and now our watch begins.\n\nWe waited and waited to finally receive the saddest, tiniest plates of food with bloated chain restaurant prices. The food was uninspired, tired, and ordinary. The only reason why I am giving them 2 stars is because of the extremely gracious and apologetic wait staff who took off 20% of our meal due to the terrible service. \n\nSo if you have decided to take a seat at Rock Bottom, take comfort in knowing that even the staff seems to know your pain.","type":"review","user_id":"l_szjd-ken3ma6oHDkTYXg","votes":{"cool":0,"funny":1,"useful":2}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-05-21","review_id":"7PsuieThUHp0BiRzzGZRkw","stars":4,"text":"Great bar. Great atmosphere. Great food. Cool place to be.\n\nDefinitely one of those places you could keep going back just because it's so chill and it's a great place for friends to just enjoy some drinks and eat some good food. Nothing too too spectacular by any means but satisfies the taste buds. Their apps are the best part and the highlight of the restaurant, in my opinion. The nachos can be split among 4-5 people easy. Lots of toppings and yummy all around.","type":"review","user_id":"tE_hS-bbao4DtMSbDVUrJA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-05-30","review_id":"FSLAun3o5bgvmB5WkZuYdQ","stars":2,"text":"While this is certainly not my first meal at Rock Bottom, this is my first meal in a year or two . The wait was minuscule, and the greeter was pleasant. As always it is a haircut weekend so the twin carnivores, the mother in law and I decided to tie the feed bag on at RB. Our server Matt was easy to work with and informative. \n\nI started off with the tortilla soup. Spicy and thick it went down easy enough. However let me say that the price at $3.50 was rather steep for the serving size. Did somebody say OUCH!! Thing one and thing two each had the 'small fry steaks'  with fruit (cantaloupe, melons, and grapes) and steamed broccoli and at $6.75 each, I think I was 'buffaloed' IF  you get my drift. The steak consisted of three small thinly sliced pieces of .... Hmmm. \n\nThey say that kids say the darnedest things well thing one noticed that his steak was very very gristly, and thing two noticed that his was rather dry. Not the best dinner they have eaten. They say you get what you pay for OR NOT!!  \n\nMy meal consisted of the Chicken Bacon Mac & Cheese  and at $14.75 I had no complaints. It was filing hot and load with chicken and bacon. How can anything be wrong with that much BACON!!! \n\nThe final dinner consisted of chicken fried chicken and at $13.95 my mother in law was sated. Over all this meal was a wash. If anyone from Rock Bottom corporate reads this... You may seriously want to rethink you portion sizes. \n\nAs you know I vote with my feet and dollars, and neither will be there again ANY time soon!!","type":"review","user_id":"PoEdd0y9A7pzbfO-njlNTQ","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-06-01","review_id":"G0dcKkvoPfwbQoBBgACNzg","stars":2,"text":"This is another one of my favorite places that had deteriorated dramatically. Corporate decided to get rid of the core beers and the beers now suck. The menu has gone from something for everyone to a couple of overpriced entrees and a bunch of small plates that are ok but not great. The service has also suffered tremendously. We are abandoning this restaurant.\n\nI don't expect this Rock Bottom to be around too much longer.  In the past, on nights when the Pirates were playing out of town, the bar and the restaurant would be packed.  Last night, it was only slightly busy.  You can usually tell when an eatery is suffering by the amount of staff on a given night and the conditions of the bathroom.  The staff was overwhelmed and the bathrooms were filthy and in serious need of repairs.  Alas, I don't think that Rock Bottom will still be in business in six months.  Hopefully, if that happens, Black Rock Bar & Steak House will find its way into Pittsburgh.","type":"review","user_id":"r_96n9O0jNzbNCZDkSB0EQ","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-06-04","review_id":"JFBd86LGVe6ac8SwtY7vUQ","stars":5,"text":"I love Rock Bottom. I don't frequent the restaurant side of RB as much as I do SingSing, but the food comes from RB. I order practically the same thing every time (Bacon Mac 'n Cheese, Brewery Nachos, and a beer...usually an IPA or a Manhattan) and the last two times I was at RB, the food was disappointing: it was cold and unappetizing, my Manhattan sucked, and the service was worse. The food is always better over at SingSing for some reason...even if they do come from the same place! \n\nI was craving the Mac 'n Cheese, so I went down to pick some up. I had a gift card, so I figured I wasn't out any money if the food sucked. I saw that there was a new menu, so I sat down to order. I got the Street Food Quesadilla, Bacon Mac 'n Cheese, and Beer Battered Onion Rings. I also ordered a Homemade Root beer and a few samples of the house beer.\n\nEverything was amazing! It came out hot and tasted awesome. They have a new Head Chef and it shows. I was floored...the new Street Food options are fun and tasty. They are unique and different...not something you'd find at any restaurants in the area.\n\nThe Service was good. My waitress was named Liz and she certainly was on point. She even helped me find a beer after I was sorely disappointed by the IPA offering...which was weird. I always thought the House Brews were tasty and fun, no matter their style or make. I'm an IPA girl, but I would happily drink anything that came from their taps. I was disappointed in the offerings, but I ended up settling on the Pale Ale that was quite tasty.\n\nIn the end, if you were turned off by Rock Bottom before, I'd definitely recommend going back to check out the Street Food and new menu offerings. Service has dramatically improved, food quality has improved,  and I was thrilled.","type":"review","user_id":"EulNEF5X3WajygN2J_JPjw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-06-08","review_id":"_5885--QcKQqHfho_kIc9A","stars":2,"text":"Stopped in for dinner an bellied up to the bar. The bar tender was quick to get me a beer (the 3 Pepper Ale which was really good) but after that I was totally ignored. Tried to get the attention of the two bartenders for about a half hour while nursing my beer. They seemed to be more interested in changing dollars for quarters and washing glasses. I got feed up, finished my beer, paid my tab and went to Uno's. Glad I did... Got great service and my meal came quickly.\n\nVerdict:  sit at the bar for a beer if that's what you want but if you're hungry and want dinner take your chances at a table.","type":"review","user_id":"2Az24juAhTJtmlqr5UWXSQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-06-10","review_id":"fIBYLAILLipjRaKtz2rtUQ","stars":3,"text":"For a chain, it is better atmosphere than you would expect.  The menu options all sound delicious, but the food quality is not great.  Just mediocre.","type":"review","user_id":"RzPqaGDpBr08NcUlWuxavQ","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-06-16","review_id":"_IrvbfcLn_LA3jpvledERQ","stars":2,"text":"Service is good, staff is friendly and knowledgeable. Beer and cocktails are good as well. Food...not so much.  My boyfriend and I shared the Jalapeno Pretzel appetizer which was pretty good, but our entrees.... disappointing.  I got the Baja chicken sandwich and he got the bison burger.   both were super dry. i could not even finish half of mine. He had to drench his in ketchup to be able to get the bison burger down. If i were to go back, it certainly would not be to eat.","type":"review","user_id":"x9TKiypH3aNUdjCIIE0b8A","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-06-22","review_id":"B51Z_nqeB2ifaMLmcW18RA","stars":2,"text":"Meh is the only thing I leave here feeling.  I ordered the classic burger because nothing on the new menu excited me.  For a side,  I requested the seasonal veggies (trying to be healthier) and was told it's a squash mixture - great I love summer squash!  \n\nI received a poorly seasoned burger. The bun had the most flavor which is a sad statement.  It was topped with an olive and a mini pickle... odd.  My \"squash\" side was lacking squash. Instead all squash was replaced by peppers... which I cannot eat.\n\nOur server was nice.  The beer was simple.  With new breweries and restaurants popping up in and around Homestead, perhaps RB should reconsider their flavors.","type":"review","user_id":"w16jpVr-b-0gd6YHwnIarg","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-06-23","review_id":"ISVre2E29xIZbx7CcSejWQ","stars":3,"text":"Apps were good, service was average, and the certified angus beef tips were awful.  They were severely overcooked and the sauce they were in had no flavor.  The picture on the menu made it appear you get a good amount of tips.  However, I was given only 4 tips, which in the end I was thankful for, because if I had any more, I would have had to rest my jaw for a couple days due to the extreme toughness and amount of chewing required to swallow those flavorless tips.","type":"review","user_id":"i9q0xISICUFE752Dj1gR4g","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-07-12","review_id":"7jVPZP0P2O39O4beJ3PAIg","stars":4,"text":"Great american style bar food with quite a lot to pick from the both the food and drink menus. They are also great at accommodating large groups and these are one of the few places that allow you to call ahead to reserve a spot. Been here plenty of times with my group and we enjoyed it every time.","type":"review","user_id":"zFt_ZSd1VMtk6o0lyvSLZQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-07-14","review_id":"NsmwjjourIq8TJmeIJF_WA","stars":2,"text":"Overpriced. Food is OK, but way overpriced. Quantities are small....much smaller than the picture in the menu. The beer is average. Butbyes","type":"review","user_id":"VGtI7xcuurVBQTbFNNsh4Q","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-07-27","review_id":"XbWRIgdlsnUgKSOmAqtXWA","stars":4,"text":"I am a FAN of rock bottom.  This is my 2nd time here and i can say i am a FAN.  We went on a Saturday night after a day at sandcastle.  The wait was 45-60 mins for a table of 5 which was to be expected on a saturday evening. \n\nOur server wasn't the best in my opinion.  She was very friendly and some what attentive but it definitely took awhile to place our orders in for our drinks, appetizers, and meals.  \n\nSince we were all hungry, I ordered us the nachos.  They were AWESOME.  Very happy and pleased with that selection. My sister ordered pretzels which were pretty good,but the clearly had TOO much salt on them.  The cheese dip that came with the pretzels however was AWESOME.  Definetly pleased with our selection.\n\nWe placed our order, which came out in a timely fashion.  Everyone was pleased.  The prices for the meal were about average for everything that you got.  I got the the margarita pizza which was pretty good.  My wife got jalpeno burger with fries.  My son got the kids pizza.  My sister and her husband got the seafood taco with shrimp and crab i believe.  The best part of this place is that they brew their own beer here.  Everyone got a honey beer (can't remember the exact kind) but it was 7.75 for 25oz which was a fair price i think.  \n\nAll in all, its def a place worth going.","type":"review","user_id":"VRB9nzZnYWB6WETk_QfIEQ","votes":{"cool":1,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-07-29","review_id":"XnQZUMxl9wp9Rixh7dJJMw","stars":4,"text":"Good beer, food and service. Arrived on a Wednesday night for business and sat at the bar. Bartender was attentive and nice. Food was great. I had the Bison Prairie Burger. It was cooked perfectly and the flavor and fries were great. I'll be coming here again on my next business trip.","type":"review","user_id":"56qmH8ZKwnWX8ulrkrVtnw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-08-29","review_id":"gaD6G-9r_mLnNIy2I9_KZw","stars":5,"text":"The food is always plentiful, the atmosphere lively, the service friendly, and even though it's always busy, I rarely have to wait for a table. \n\nIf you're a nachos fan, this is the place! Often, I just make it my appetizer, salad, and meal. Yes, it's that big. \n\nEven though I'm not a big beer drinker, I enjoy their sampler, and I LOVE their cider; it had just the right amount of kick.","type":"review","user_id":"t8dYy7st__ZhQ8mJsxvNTw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-09-06","review_id":"qzdTwHp0m-gQ1X8R28DDbw","stars":4,"text":"Came to this place last night after shopping!\nFood was pretty good! Service was good. \nSat outside. Nice space!","type":"review","user_id":"40fyRd2GbTASeYF56YimLg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-09-18","review_id":"HWDCA6C-LaGO2xkulIAXBQ","stars":4,"text":"They did a good job accommodating a large group. Mac N Cheese with chicken and bacon was good. In house beers were moderate and selection was limited. Good service, franchise-ish ambiance, nothing extraordinary but easy enough.","type":"review","user_id":"bQdtQJhFXjiuHrgscbU_uw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-09-19","review_id":"68JQjmAkN2x2pXPNd_2j2w","stars":3,"text":"Loved the American Blonde and gram's oat soda IPA.  Good service.    Egg rolls were very good.  Our bar tender was very attentive and helpful in selecting the beers.","type":"review","user_id":"brVHUxer-ZTASTKIikehcA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-09-29","review_id":"Ke9TwuxXOmkexliK5yaM3A","stars":3,"text":"If your in the market for a beer or two this could be an option. They have a nice seasonal selection and it's all tap which I prefer. I also like that most of the seating is booth. On my visit the service was lack luster. I have no idea where the waitress went for half the meal and her listening skills left much to be desired. I went with a beer sampler. It was nice being able to try everything they have. I of course went with the pumpkin beer. For my main dish I had stuffed peppers which I honestly enjoyed. They had a great flavor. My only issue is the rice that came with it was a bit under cooked. If service was better and my rice was cooked I would have given this place a solid 4 stars but that unfortunately wasn't the case on this particular visit.","type":"review","user_id":"s_sAdwMW2aimtkrJyi0UCw","votes":{"cool":8,"funny":5,"useful":13}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-10-22","review_id":"Ke3khP1_x9tER4Y6PhHmng","stars":5,"text":"I'm visiting Homestead this week for some work-related training.  Rock Bottom was recommended by the receptionist at my hotel, and I'm so glad it was!  I've been there twice already and will go back before I leave in a few days.  I sat at the bar during both of my visits, and the bartenders were both very nice...Bob during the day and Paul at night.  The pumpkin beer and milk stout are both awesome.  Like other reviewers stated, the nachos are great!  I think the best part was that everyone was very friendly.  Other customers seated at the bar were eager to chat, which is so nice when you don't know anyone in the area!  Great place!  Thanks for the hospitality!","type":"review","user_id":"NHQSPdbpYr2Y0_zaoiS6Kw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-11-15","review_id":"myewFsQQP2bbbnMUZtGMhg","stars":3,"text":"Came here on a Saturday night. Waited over an hour for a table for 2, but enjoyed some great beers from the bar while waiting. Ordered the calamari appetizer to start which was very good. My fish and chips entree was cold, but my boyfriends 2 am burger was phenomenal.","type":"review","user_id":"Bn0Y1KkaX4NHQyZ80m4Ktg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-11-17","review_id":"U-E6k0wqnH4rs-tf_fm8dQ","stars":1,"text":"Very disappointing menu. Pseudo Mexican and south of the border fare. I had the Beef Tip Sliders. What a ridicules offering. Each one (2 on a plate) had a nickel sized piece of beef on an oblong  3\" bun. It was taken back to the kitchen, after I complained, and a thin sliver now appeared. The only thing good about this experience, the waiter was nice!\nAs the raven said, \"Never, never more.\"","type":"review","user_id":"jzVU2rvLsgu0DoBwqlMKGg","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-11-28","review_id":"zqbrboN_b5ddjQgKInmopg","stars":5,"text":"We stopped in to grabs bite to eat before we went to Improv. My wife and I got the bacon chicken mac&cheese. It was absolutely delicious right down to the last bite. We raved about it all night long. Our friend got a burger and asked for it well done. It came out medium. So she sent it back. The manger brought out the new one and he took care of our friends check. Pretty great service. She loved the burger, and said it was one of the best she has had. \nI had the beer sampler and I liked all six beers. They were good. \nI would recommend this place and if we are down that way I will definitely go back.","type":"review","user_id":"kJVSXidaaefpT7Lwh6B3ww","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2015-12-17","review_id":"ILYJV8NMKZ7i6cnnH5LuNQ","stars":5,"text":"Great selection of beers especially the seasonal ones! You won't be disappointed. The Jalapeo pretzels are dope!","type":"review","user_id":"64GBbjUMe_n6Yhi7OH_H6Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-01","review_id":"H4KM-MmvFAM6om44Rx8nlQ","stars":2,"text":"I'm very disappointed to say this place has gone down hill. While my boyfriend and I use to really enjoy coming here, the food has gotten considerably worse. They've taken many things off the menu we use to enjoy, such as the pretzel sticks with beer cheese, and replaced them with frozen ballpark pretzels and nacho cheese. Tonight I ordered a steak salad, of which the steak was good, but there was nothing on the salad that was listed on the menu. Not to mention the whole place smells smells like dirty mop water. The beer is still very good, that's why still gave them 2 stars.","type":"review","user_id":"f7LtWUAaG3z-VLYjuHakzQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-01","review_id":"tK4XZiAnQPesy9i5WP7thQ","stars":4,"text":"We were a party of four. My wife and I ordered the stuffed pepper. It was very spicy with some serious zip. However, it was delicious. My youngest son had the chicken enchiladas. He thought that those were the best that he ever had. My oldest son had the chicken mac-n-cheese. He thought that it was very good. We all shared the calamari and jalapeno appetizer-- very spicy, but very good. We also had the buffalo wing appetizer. The sauce was very good, but the wings were OK. The brownie dessert was a little disappointing. The brownies were dry. I also had the key lime dessert. It was OK. The service was outstanding. The atmosphere was vibrant and enjoyable. We will definitely return the next time that we are in Pittsburgh.","type":"review","user_id":"WUSgPyT3p6duI27l2QkGRQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-02","review_id":"V25iMGV504Dc0B7FpAnJrg","stars":4,"text":"We stopped into Rock Bottom for a late dinner. The place was hopping-the bar side and the restaurant side. We chose to dine on the restaurant side. There were a lot of great choices on the menu. I chose the grilled chicken sandwich which had barbecue sauce, bacon, cheddar cheese, pickles, lettuce, tomatoes, and red onions. The chicken it self had a great grilled flavor. I think it was good enough to eat plain. The barbecue sauce was smokey with a hint of sweetness. The pickles added a tangyness. It was a huge sandwich. It was served with fries but they were a little soft. They needed a few more minutes of cooking. \nI only ate half of my sandwich so I would have room for dessert. They have a couple of smaller desserts that are served in Mason jars. Then they have a few that are larger that you could share with 2pr 3 people. I ordered the cheesecake with caramel and toffee. Yum!!!! It was the perfect ending to a good meal.","type":"review","user_id":"KSS6v5fcZNoelu4eEZCFcw","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-05","review_id":"cNlBP075Q0g_UpupGEhvXA","stars":1,"text":"Ergh, this place. I hate giving bad reviews but on my latest visit, I should have listened to my gut and not repeated my visit here. Naturally, I'm not a stranger to this chain, understand it's a chain, but the past visit here was just not good.\n\nCame with my brother on a Sunday after a driving lesson. We were hungry and this was his way of paying for gas money. We were seated in the dining area. Every time we are seated in the dining area it's a bad experience. On the bar side you get entertainment, the beer flights/draft specials are decent and the bar food/appetizers are passable.\n\nIt started off with the soft drinks. I'm not a pop drinkers so when I want a simple diet pepsi I expect it not to taste funky [and yes, I prefer the weird twang of diet drinks to sugar in a glass taste of regular]. There was incorrect carbonation, whether they were running out [I suspect this], no ice [lukewarm] or they had just hooked up a new box [unlikely]. I sent it back.\n\nMy brother got a burger which he said was fine, it came with an egg on it and he found himself satisfied. I tried to steal a few of his fries, which were a failure. They tasted like the off brand in the freezer section [a full mouth of starch], and were barely crispy enough. So abandon plan. On my own dish I had the classic mac n' chicken. First of all, the pasta was crispy?, really?, it wasn't a cheese sauce, it was pretty much butter baked on and sprinkled in Parmesan and smothered in breadcrumbs. And when I say smothered here, this is not a good thing. Sigh. The chicken was pushed to the bottom of the pan, which my brother tasted because I was turned off my this version of my favorite dish, and said it was cooked properly. A small save? \n\nAgain - I sent it back after about 3 bites. The waitress came back asking if I wanted a box, I told her to take it away. She did and disappeared into oblivion until we had to flag her down for the check, which I didn't see as my brother paid for it while I used the restroom, I hope they didn't charge us for the pop drink.... Needless to say, I came home hungry. \n\nHonestly, if you come, come for drinks and a salad, they don't screw those up. Everything else, avoid.","type":"review","user_id":"csNALHN2BVA7hVgC9ge-VQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-09","review_id":"hAzwPxBcX19hCREEPtmgWA","stars":5,"text":"I've been coming here a lot lately and the food is consistently good. Their burgers are great (especially the 2:00 am burger) and the staff is always friendly. I haven't tried too many of their beers but the food will keep me coming back!","type":"review","user_id":"pJeOLsK8IWGeM5KKewO4hA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-10","review_id":"aEvm-HWzScqeP514dTJtYQ","stars":3,"text":"Was only here for drinks so this is not a reflection on food. Tried their standard flight and greatly enjoyed the Xm@s but nothing else stood out. Also had the Gentleman, Holly's Mistletoe and Lively. The Gentleman was good in my opinion.  2 out of 8 beers impressed me and above standard for my tastes while the others were below standard when it comes to craft beers.  Again this is my opinion. I have a wide range of styles I enjoy but IPAs are a solid choice for me.  Pricing for flights was excellent at $6 for 6 4oz. tasters.\n\nThe service was lackluster. Myself and two friends were sat and the waitress took my order and the other man but ignored the girl that was with us and walked off without even asking her if she would like anything. She was a bit put off to say the least. We tracked the waitress down and she apologized but the rest of the stay was a bit awkward.  \n\nI hear the food is very good and will return to try it and adjust my review accordingly.","type":"review","user_id":"TyxrMu8pBIF1WrTaTf2q3Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-29","review_id":"GzQixkSZwCMpd4m2MRaMHA","stars":4,"text":"A friend and I stopped in to Rock Bottom Brewery before a movie on a cold Thursday.  It was a short hike from the theater, but I am not cold tolerant, and was glad of the warm, comfortable restaurant interior.  It was pretty empty (my favorite), and we were ushered to a booth, which was roomy and comfortable.  \n\nOur server was friendly, attentive, and made great recommendations.  The beers were very tasty!  Even though we were starving, our server recommended getting 1/2 order of nachos if we planned to get dinner.  GOOD TIP!!!  The half order of nachos is piled on to a traditional dinner plate, and it was plenty of appetizer for 2 people.  My friend got the country fried chicken with mashed potatoes and slaw.  She seemed to enjoy it.  I got the veggie pizza with feta, which was good, but I think I would have been happier with something else.  There was no fatal flaw in the pizza, I think I was stuck eating bread with grilled veggies and feta while my friend ate fried chicken- and that was entirely my fault. \n\nOverall, this was a positive experience.  It has a \"chain\" feel (because it is a chain), but I would go back and recommend it to others.  It is for foodies? Nope.  It is amazingly original?  Nope.  But it is good food, good beer, good service, and a fair price.  Definitely.","type":"review","user_id":"gILQPFOkYOJaDv3ZhLszLg","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-01-31","review_id":"8OGsnxunqV6cuQ3IvZ4Rew","stars":1,"text":"first bad experience at this place. double swiss burger was as tasteless as they could make. I asked for medium cooked and they gave me burnt. instead of caramelized onions, they added raw onions. they should check the quality of jalapeos they use, it was not hot at all. they also forgot to add mayo.\nohh and they took 50 minutes to prepare this burger, and we missed our movie at amc. \nthe waiter did not even bother to ask if everything was okay. won't visit again.","type":"review","user_id":"XnxbxdQJb83KLOOSXpOuUw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-02-13","review_id":"XT80DoG0q_Y21YjU6jdaAw","stars":4,"text":"Saturday night, Valentine's Weekend around 7 pm - Larger tables sat quicker from what I could tell when we were waiting. I was with one other person and we waited upwards of 50 minutes for a table. When we were finally sat it was by the door where it was really drafty. It was below freezing out, and we were both really cold. The food was great though when it came, and it somewhat warned us up. We ordered the tortilla soup, nachos, Diablo pizza, and 2 am burger. The soup was delicious. I'm itching to have another bowl already. I also tried their darkest beer that had hints of cacao and peanut butter. I'm not a beer fan, but I really liked it. Our waitress was extremely nice as well. We were comped 20 something dollars when we didn't even complain or say anything. It was a nice surprise when we got our bill. I'll definitely be back.","type":"review","user_id":"jW38xpayJghah5L8i9FOww","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-02-14","review_id":"ig1r73Qqm3vRxFPJdd6UPA","stars":3,"text":"The first time I experienced the Rock Bottom Brewery was in downtown Chicago. It was wonderful! I think I went back the next night because I had such a good experience. It's pretty much always packed around happy hour/dinner time because it's a great spot. \n\nThe Pittsburgh location doesn't quite compare. The actual layout, food, service, etc., is average. I ordered the bison burger last night and it was pretty good. But, it was a bit dry and it didn't seem like they put much effort into it. Honesty, when I received my food, it reminded me of being at a place like Applebee's of Chili's. They were out of Mac and cheese because they had had a busy night. I didn't mind that at all because I had tried the Mac and cheese before; you should give it a try if you haven't. \n\nThe waitress was great. She checked in often to make sure we were comfortable. The menu is large. You're sure to find something you want to try. But it's a brewery, so the options are mostly variations of bar foods. It's a cool place to go if you want to eat late and have a decent sized group with you.","type":"review","user_id":"78df08rvfTRKXcqxz3eS0A","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-02-15","review_id":"Z_BIMMt0KLkFtebwCsEk5Q","stars":2,"text":"We waited for almost an hour, while groups smaller and larger, who had arrived both before and after us, streamed in and out. When we checked on our table status, they only replied \"You have 19 minutes\" to wait. I guess it didn't matter that I could see tons of open tables if they have some sort of seating timer. Once we were seated, our waiter was quick but that's just about the extent of anything nice I have to say. The other folks in our party mentioned that the burgers were pretty good; however, my Cuban Cristo was a mess. It had too much batter and was fried too long, resulting in a greasy, brick of a sandwich. And, for a brewery, I was extremely disappointed by the small size of their beer list. Overall, it was a mediocre experience with forgettable food. I won't be going back.","type":"review","user_id":"-la6YVHqiwf2fR8o617mBQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-03-01","review_id":"LLBzOWcUMpsJBP4MFRUpPg","stars":3,"text":"Rock Bottom is a decent larger sports/brew pub seating is at a premium on weekend evenings, prepare to wait an hour to be seated at a table or try your luck scurrying against others as a high-top becomes available in the bar.\n\nThe food is average, nothing extraordinary...we did get the sausage filled pretzels bites, they had little or no  sausage in half of them (should have gotten the ball park pretzel)\n\nThey do offer a drink and wine selection but beer is limited to house brew only.","type":"review","user_id":"DLo9Ugw1LlMPJeBiX7zm8w","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-03-06","review_id":"wjFk2IFp8RxCfGmrU6arog","stars":4,"text":"We got here at the last minute last night before the kitchen closed, there were five of us, and we got right in and had awesome service. We tried two beer flights so we could have the entire beer menu. The flights are priced exceptionally well. We had the nachos for an appetizer, which were good but not the best I've ever had. I had the Brewer's Cobb, which has always been amazing at every Rock Bottom I've ever been to and an extraordinary amount. My husband had the beef tips, which tasted good but didn't have a lot of meat. It left him wanting more. The mashed potatoes and onion straws paired with the tips were good though. The atmosphere was great, it was clean, and our server was friendly and attentive. Very happy with the experience.","type":"review","user_id":"96Nbis96pknb6T05nKr-0Q","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-03-18","review_id":"_bPLCcVYvocN3mSMvnErZQ","stars":5,"text":"I had my baby shower here. The space very nice, staff friendly, and everyone loved the food, especially the chicken Mac n cheese! Everyone is still raving about it!","type":"review","user_id":"jCe7-XK9GA0AdeKPNCLhqQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-04-01","review_id":"YkmUJQYJTR0_OmBxjWS4rQ","stars":2,"text":"The experience was different the second time around. We asked for a booth and got one right away. When we sat down, the waitress came fast and serve our drinks and appetizers fast. The food was great until the steak and shrimp came with the broccoli. It was not good, the broccoli was burnt bad and I ask medium well and they sent it bloody. My boyfriend's bison burger was not that tasty either he sent it back. They sent the burnt broccoli back and I got a great salad, the steak had to go all the way to well done, but I believe the grill is not being clean properly cause the steak tasted burnt and charred. So the manager came over and ask my boyfriend if he wanted something else, he didn't and he asked me how he could make it better, I asked that next time could we have are food done properly cooked. He apologized and actually looked out with discounting the meal and gave us fresh spinach dip, which I enjoyed. I will not return but the customer service was awesome and I won't say don't go, but know what to order and what to watch out for when ordering!","type":"review","user_id":"GjZoIaYYQmRPCSvfd4CLbw","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-04-10","review_id":"x8ZUDmh7og-WpspNm6qYUw","stars":2,"text":"Very disappointed with this place. A lot of people standing around, table and menus sticky, the food was FUCKED!! Sent my pathetic Bruschetta chicken back because it was the size of a chicken nugget with one giant stem of broccoli.  Do not come here to eat. \n2 stars because the beer was good.","type":"review","user_id":"VohK-9RThOhnxC9fV1Ec4Q","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-04-14","review_id":"RDLjicDuOO_8J1hkysYpMA","stars":2,"text":"Although the proximity to my house adds convenience as a factor in going to Rock Bottom, the food is less than desirable. \n\nThe beer there is great, it's a fairly clean establishment with a good wait staff, but the food IS AWFUL. I ordered the quesadilla appetizer, and for $10.59 I got 4 mini tortillas, not toasted at all, with some melted cheese and chicken. No salsa, no lettuce, guac, sour cream.  NOTHING. \n\nThen I was hoping the pizza I ordered would sort of redeem our experience, I got their \"hot\" style pizza since I like spicy food. The small pizza probably had 8 jalapeos worth of peppers, and then some sauce and cheese. It was so underwhelming. I wish the food could match the quality of their beer. Real bummer.","type":"review","user_id":"KNfnkqbl0ttg6VpOY81bbQ","votes":{"cool":0,"funny":0,"useful":1}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-05-09","review_id":"4MvGEJxGwC3qJI8hX7qcrg","stars":3,"text":"My husband and I were fans of the Denver Rock Bottom when we lived in Colorado, so we decided to have a date night at the Pittsburgh location a few weeks ago.\n\nThey were very crowded, but we got a reservation on OpenTable and were able to skip the line.  We arrived a few minutes early, but they were able to seat us when we got there.  \n\nThe beer is consistently good here--  I went with the fire chief red ale, and my husband tried both one of the cask strength beers and an IPA.  I ordered the bacon chicken mac n' cheese, and it was as good as I remembered.  My husband's steak was overdone, but the servers were very apologetic (they offered to replace it, and ended up comping it) and he said it was seasoned well.  For dessert, we split the mason jar bourbon pecan pie, and it was delicious, with a really delicious ice cream on top.\n\nThis location may not have quite lived up to our expectations from the original, but I'd be happy to end up here again if I'm in the area.","type":"review","user_id":"qlcwfLpIG62p2VccbG-idQ","votes":{"cool":2,"funny":0,"useful":3}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-05-17","review_id":"oZuJfjYU7HlypclphjKCHw","stars":4,"text":"A group of eight of us came here because Burgatory couldn't seat us (big surprise there) and none of us had been at this location before so we were willing to give it a shot.  They were able to seat us, not at the same table but at two adjacent tables.  We were flexible and more than happy to take that.\n\nI had the Bourbonzola burger.  It wasn't the best burger I had ever had, but it certainly wasn't the worst.  It satisfied the craving I had and that was really all I expected.\n\nThe reason I'm giving this place a four star is the beer.  I had the High-Level IPA and it was fantastic.  Rock Bottom is know for its beer and they did not disappoint.  Everyone in our group that had beer was impressed.\n\nDon't go to Rock Bottom necessarily expecting the best food you've ever had and you won't be disappointed with the experience.  What you can do though is go expecting some pretty damn good beer.  Do that and you won't be disappointed.","type":"review","user_id":"EBJA1RM-6HfN4R222ilFeA","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-05-26","review_id":"1NobV96sTh8yF_Bcov3Fxw","stars":4,"text":"Food was very good and reasonably priced. Had great draft choices. I would recommend going early especially on the weekends or sit in the bar area. Very crowded and noisy","type":"review","user_id":"5saP3QHXgNq738qLCiq12w","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-06-01","review_id":"mKs779tUoNZRYYJ-lrDwSQ","stars":4,"text":"I've been coming to Rock Bottom for many years and am a loyal member of their \"mug club\", which, if you come more than once, you should sign up for because membership comes with a few nice perks.\nRock Bottom brews some of their own beers with a nice variety of ambers, reds, and IPAs.  Typically when I'm here I like to sit at the bar or in one of the high tops near the bar where you can seat yourself.  If weather permits they also have a nice sized patio where you can also dine.\nUsually I'm here to share appetizers and my go to is the ballpark soft pretzels with the cheese dip.  They also serve some pretty good nachos. \nWhen ordering from the menu I've found the grilled chicken BBQ sandwich to be a HUGE HIT.  This is one delicious sandwich.  \nPrices are reasonable, service is typically good, and the beer is flowing.  Nice option when in the Waterfront area.","type":"review","user_id":"lAqoz5QTFxp3GDfpq0McRQ","votes":{"cool":0,"funny":0,"useful":2}}
{"business_id":"McikHxxEqZ2X0joaRNKlaw","date":"2016-06-05","review_id":"KBw0yrBKff4Nm_3jf8rcdA","stars":1,"text":"If you want rock bottom food, head to Rock Bottom. Slow service, horrible, horrible food.   Was served freezing cold enchiladas and pizza.   The enchiladas were supposed to be chicken and had two tiny strips of chicken and I'm talking minuscule.   Rice was still cold when it was served a second time a half hour later.   Manager apologized and waitress offered us something while we waited for our food for the second time.   I don't know whose fault it was, but there are clearly some problems in house.   I'll take the blame for ordering chicken enchiladas at a brewery but wow, they were so horrid!","type":"review","user_id":"j5oVuzkGBieqUOm8L3v46Q","votes":{"cool":1,"funny":0,"useful":1}}
{"business_id":"HwwEfnZKLNOUoqfgcwAgcQ","date":"2009-11-10","review_id":"KT-v2v1IS-tPSthwGaQxPA","stars":4,"text":"One comfy seat in the entire place, but they have a cafe, they have good books to look at, and they are open until 11pm.  What more could you want?  Why an APPLE PURSE of course!  And a nice Earl Gray tea thrown in for good measure.  Wow...I love this place.  I am such a nerd...only a nerd would enjoy going to a book store and reading as much as I do.  The extra amenities just make it that much more enjoyable.","type":"review","user_id":"T_wjLgPOPXry7Bea4MzoVQ","votes":{"cool":0,"funny":0,"useful":0}}
{"business_id":"HwwEfnZKLNOUoqfgcwAgcQ","date":"2012-01-01","review_id":"WliIk23b0WcIFDTYXIezzQ","stars":4,"text":"Like any Barnes & Noble, it has a nice comfy cafe, and a large selection of books.  The staff is very friendly and helpful.  They stock a decent selection, and the prices are pretty reasonable.  Obviously it's hard for them to compete with Amazon.  However since all the small shop bookstores are gone, it's nice to walk into one every once in a while.","type":"review","user_id":"clgaCFcZ0-JnM7V9DGbOlg","votes":{"cool":0,"funny":0,"useful":0}}